<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>dos2unix 7.5.2 - &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x430; &#x434;&#x43b;&#x44f; &#x43f;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43e;&#x440;&#x435;&#x43d;&#x43d;&#x44f; &#x434;&#x430;&#x43d;&#x438;&#x445; &#x443; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x43e;&#x43c;&#x443; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x456; DOS/Mac &#x443; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442; Unix, &#x456; &#x43d;&#x430;&#x432;&#x43f;&#x430;&#x43a;&#x438;</title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:ASSI@walter.nonet" />
</head>

<body>



<ul id="index">
  <li><a href="#">&#x41D;&#x410;&#x417;&#x412;&#x410;</a></li>
  <li><a href="#1">&#x41A;&#x41E;&#x420;&#x41E;&#x422;&#x41A;&#x418;&#x419; &#x41E;&#x41F;&#x418;&#x421;</a></li>
  <li><a href="#2">&#x41E;&#x41F;&#x418;&#x421;</a></li>
  <li><a href="#3">&#x41F;&#x410;&#x420;&#x410;&#x41C;&#x415;&#x422;&#x420;&#x418;</a></li>
  <li><a href="#MAC">&#x420;&#x415;&#x416;&#x418;&#x41C; MAC</a></li>
  <li><a href="#4">&#x420;&#x415;&#x416;&#x418;&#x41C;&#x418; &#x41F;&#x415;&#x420;&#x415;&#x422;&#x412;&#x41E;&#x420;&#x415;&#x41D;&#x41D;&#x42F;</a></li>
  <li><a href="#UNICODE">UNICODE</a>
    <ul>
      <li><a href="#5">&#x41A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</a></li>
      <li><a href="#6">&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;</a></li>
      <li><a href="#7">&#x41F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;</a></li>
      <li><a href="#Unicode-Windows">&#x41D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; Unicode &#x443; Windows</a></li>
      <li><a href="#Unicode">&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x434;&#x43B;&#x44F; Unicode</a></li>
    </ul>
  </li>
  <li><a href="#GB18030">GB18030</a></li>
  <li><a href="#8">&#x41F;&#x420;&#x418;&#x41A;&#x41B;&#x410;&#x414;&#x418;</a></li>
  <li><a href="#9">&#x420;&#x415;&#x41A;&#x423;&#x420;&#x421;&#x418;&#x412;&#x41D;&#x415; &#x41F;&#x415;&#x420;&#x415;&#x422;&#x412;&#x41E;&#x420;&#x415;&#x41D;&#x41D;&#x42F;</a></li>
  <li><a href="#10">&#x41B;&#x41E;&#x41A;&#x410;&#x41B;&#x406;&#x417;&#x410;&#x426;&#x406;&#x42F;</a></li>
  <li><a href="#11">&#x41F;&#x41E;&#x412;&#x415;&#x420;&#x41D;&#x423;&#x422;&#x415; &#x417;&#x41D;&#x410;&#x427;&#x415;&#x41D;&#x41D;&#x42F;</a></li>
  <li><a href="#12">&#x421;&#x422;&#x410;&#x41D;&#x414;&#x410;&#x420;&#x422;&#x418;</a></li>
  <li><a href="#13">&#x410;&#x412;&#x422;&#x41E;&#x420;&#x418;</a></li>
  <li><a href="#14">&#x422;&#x410;&#x41A;&#x41E;&#x416; &#x41F;&#x415;&#x420;&#x415;&#x413;&#x41B;&#x42F;&#x41D;&#x42C;&#x422;&#x415;</a></li>
</ul>

<h1 id="">&#x41D;&#x410;&#x417;&#x412;&#x410;</h1>

<p>dos2unix - &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; DOS/Mac &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; Unix, &#x456; &#x43D;&#x430;&#x432;&#x43F;&#x430;&#x43A;&#x438;</p>

<h1 id="1">&#x41A;&#x41E;&#x420;&#x41E;&#x422;&#x41A;&#x418;&#x419; &#x41E;&#x41F;&#x418;&#x421;</h1>

<pre><code>dos2unix [&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;] [&#x424;&#x410;&#x419;&#x41B; ...] [-n &#x412;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B; &#x412;&#x418;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B; ...]
unix2dos [&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;] [&#x424;&#x410;&#x419;&#x41B; ...] [-n &#x412;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B; &#x412;&#x418;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B; ...]</code></pre>

<h1 id="2">&#x41E;&#x41F;&#x418;&#x421;</h1>

<p>&#x414;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x43F;&#x430;&#x43A;&#x443;&#x43D;&#x43A;&#x430; Dos2unix &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; <code>dos2unix</code> &#x442;&#x430; <code>unix2dos</code>, &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; DOS &#x430;&#x431;&#x43E; Mac &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; Unix, &#x456; &#x43D;&#x430;&#x432;&#x43F;&#x430;&#x43A;&#x438;.</p>

<p>&#x423; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; DOS/Windows &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x430;&#x431;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x456;&#x434; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x437;&#x434;&#x456;&#x439;&#x441;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x430;&#x446;&#x456;&#x457; &#x434;&#x432;&#x43E;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;: &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x430;&#x440;&#x435;&#x442;&#x43A;&#x438; (CR) &#x456; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x430; (LF). &#x423; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; Unix &#x437;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x456;&#x434; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;: &#x43F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x430; (LF). &#x423; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; Mac, &#x434;&#x43E; Mac OS X, &#x437;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x432; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;: &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x430;&#x440;&#x435;&#x442;&#x43A;&#x438; (CR). &#x423; &#x441;&#x443;&#x447;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F;&#x445; Mac OS &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x439; &#x434;&#x43B;&#x44F; Unix &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; (LF).</p>

<p>&#x41E;&#x43A;&#x440;&#x456;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; Dos2unix &#x437;&#x434;&#x430;&#x442;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;. &#x41C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x445; DOS &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Latin-1 Unix. &#x422;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; Windows Unicode (UTF-16) &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Unix Unicode (UTF-8).</p>

<p>&#x41F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x434;&#x432;&#x456;&#x439;&#x43A;&#x43E;&#x432;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43D;&#x430;&#x43A;&#x430;&#x436;&#x435;&#x442;&#x435; &#x457;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;.</p>

<p>&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x454; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x43C;&#x438;, &#x437;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x438; &#x442;&#x430; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x438; FIFO.</p>

<p>&#x422;&#x438;&#x43F;&#x43E;&#x432;&#x43E;, &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43D;&#x435; &#x432;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x438;&#x43C;&#x435; &#x437;&#x43C;&#x456;&#x43D; &#x434;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x44C; &#x442;&#x430; &#x43E;&#x431;&rsquo;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x44C;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;, &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430;-&#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;. &#x423; Windows &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x434;&#x43E; &#x43E;&#x431;&rsquo;&#x454;&#x43A;&#x442;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E;.</p>

<p>&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443; dos2unix &#x431;&#x443;&#x43B;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x437;&#x430; &#x437;&#x440;&#x430;&#x437;&#x43A;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; dos2unix &#x434;&#x43B;&#x44F; SunOS/Solaris. &#x412;&#x442;&#x456;&#x43C;, &#x456;&#x441;&#x43D;&#x443;&#x454; &#x43E;&#x434;&#x43D;&#x430; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x434;&#x43B;&#x44F; SunOS/Solaris. &#x426;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; (&#x441;&#x442;&#x430;&#x440;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;), &#x430; &#x443; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x434;&#x43B;&#x44F; SunOS/Solaris &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x430;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; (&#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;). &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; <code>-o</code> &#x442;&#x430; <code>-n</code>. &#x429;&#x435; &#x43E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x443; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x434;&#x43B;&#x44F; SunOS/Solaris &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x432;&#x441;&#x44F; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; <i>iso</i>, &#x430; &#x443; &#x446;&#x456;&#x439; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x43C; &#x454; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; <i>ascii</i>.</p>

<h1 id="3">&#x41F;&#x410;&#x420;&#x410;&#x41C;&#x415;&#x422;&#x420;&#x418;</h1>

<dl>

<dt id="pod"><b>--</b></dt>
<dd>

<p>&#x412;&#x432;&#x430;&#x436;&#x430;&#x442;&#x438; &#x443;&#x441;&#x456; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43C;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;. &#x426;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x447;&#x438;&#x457; &#x43D;&#x430;&#x437;&#x432;&#x438; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x434;&#x435;&#x444;&#x456;&#x441;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x430; &laquo;-foo&raquo;, &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x44E;:</p>

<pre><code>dos2unix -- -foo</code></pre>

<p>&#x410;&#x431;&#x43E; &#x443; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;:</p>

<pre><code>dos2unix -n -- -foo out.txt</code></pre>

</dd>
<dt id="allow-chown"><b>--allow-chown</b></dt>
<dd>

<p>&#x414;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x443; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x446;&#x435;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;, &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x438;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x443; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43D;&#x435; &#x432;&#x434;&#x430;&#x441;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x434;&#x43E; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430; &#x456;/&#x430;&#x431;&#x43E; &#x433;&#x440;&#x443;&#x43F;&#x438;. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F;, &#x430; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43D;&#x43E;&#x432;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430;, &#x442;&#x430;&#x43A;&#x456;, &#x43D;&#x430;&#x447;&#x435; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x443; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; <code>-o</code> &#x456; <code>-n</code>. &#x426;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x43B;&#x438;&#x448;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x443; dos2unix &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430;&#x43C; &#x456; &#x433;&#x440;&#x443;&#x43F;&#x430;&#x43C;.</p>

</dd>
<dt id="ascii"><b>-ascii</b></dt>
<dd>

<p>&#x422;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; &#x449;&#x43E;&#x434;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;.</p>

</dd>
<dt id="iso"><b>-iso</b></dt>
<dd>

<p>&#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; DOS &#x43D;&#x430; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; ISO-8859-1. &#x414;&#x438;&#x432;. &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; &#x449;&#x43E;&#x434;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;.</p>

</dd>
<dt id="pod-1252"><b>-1252</b></dt>
<dd>

<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x44E; 1252 Windows (&#x437;&#x430;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x454;&#x432;&#x440;&#x43E;&#x43F;&#x435;&#x439;&#x441;&#x44C;&#x43A;&#x456; &#x43C;&#x43E;&#x432;&#x438;).</p>

</dd>
<dt id="pod-437"><b>-437</b></dt>
<dd>

<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; DOS 437 (&#x421;&#x428;&#x410;). &#x426;&#x435; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x430; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x430; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; ISO.</p>

</dd>
<dt id="pod-850"><b>-850</b></dt>
<dd>

<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; DOS 850 (&#x437;&#x430;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x454;&#x432;&#x440;&#x43E;&#x43F;&#x435;&#x439;&#x441;&#x44C;&#x43A;&#x456; &#x43C;&#x43E;&#x432;&#x438;).</p>

</dd>
<dt id="pod-860"><b>-860</b></dt>
<dd>

<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; DOS 860 (&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x433;&#x430;&#x43B;&#x44C;&#x441;&#x44C;&#x43A;&#x430;).</p>

</dd>
<dt id="pod-863"><b>-863</b></dt>
<dd>

<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; DOS 863 (&#x43A;&#x430;&#x43D;&#x430;&#x434;&#x441;&#x44C;&#x43A;&#x430; &#x444;&#x440;&#x430;&#x43D;&#x446;&#x443;&#x437;&#x44C;&#x43A;&#x430;).</p>

</dd>
<dt id="pod-865"><b>-865</b></dt>
<dd>

<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; DOS 865 (&#x441;&#x43A;&#x430;&#x43D;&#x434;&#x438;&#x43D;&#x430;&#x432;&#x441;&#x44C;&#x43A;&#x456; &#x43C;&#x43E;&#x432;&#x438;).</p>

</dd>
<dt id="pod-7"><b>-7</b></dt>
<dd>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; 8-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43D;&#x430; 7-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x456;.</p>

</dd>
<dt id="b---keep-bom"><b>-b, --keep-bom</b></dt>
<dd>

<p>&#x417;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM). &#x42F;&#x43A;&#x449;&#x43E; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x454; BOM, &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; BOM &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;. &#x426;&#x435; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x456;&#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-r</code>.</p>

</dd>
<dt id="c---convmode"><b>-c, --convmode &#x420;&#x415;&#x416;&#x418;&#x41C;</b></dt>
<dd>

<p>&#x412;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x420;&#x415;&#x416;&#x418;&#x41C; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;: <i>ascii</i>, <i>7bit</i>, <i>iso</i>, <i>mac</i>. &#x422;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x43C; &#x454; &#x440;&#x435;&#x436;&#x438;&#x43C; ascii.</p>

</dd>
<dt id="D---display-enc"><b>-D, --display-enc &#x41A;&#x41E;&#x414;&#x423;&#x412;&#x410;&#x41D;&#x41D;&#x42F;</b></dt>
<dd>

<p>&#x412;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;. &#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; &#x41A;&#x41E;&#x414;&#x423;&#x412;&#x410;&#x41D;&#x41D;&#x42F;: <i>ansi</i>, <i>unicode</i>, <i>unicodebom</i>, <i>utf8</i>, <i>utf8bom</i>, &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x43C; &#x454; ansi.</p>

<p>&#x426;&#x435;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43B;&#x438;&#x448;&#x435; &#x443; dos2unix &#x434;&#x43B;&#x44F; Windows &#x437; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x43E;&#x44E; &#x43D;&#x430;&#x437;&#x432; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; Unicode. &#x426;&#x435;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x43D;&#x435; &#x432;&#x43F;&#x43B;&#x438;&#x432;&#x430;&#x454; &#x43D;&#x430; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x436;&#x43D;&#x454; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x43D;&#x430;&#x437;&#x432; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x43B;&#x438;&#x448;&#x435; &#x43D;&#x430; &#x442;&#x435;, &#x44F;&#x43A; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x446;&#x456; &#x43D;&#x430;&#x437;&#x432;&#x438;.</p>

<p>&#x406;&#x441;&#x43D;&#x443;&#x454; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456; Windows, &#x437;&#x430;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x430; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;. &#x423;&#x441;&#x456; &#x446;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x457; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x438; &#x456; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x438;.</p>

<dl>

<dt id="ansi"><b>ansi</b></dt>
<dd>

<p>&#x422;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; dos2unix &#x454; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; ANSI. &#x41F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x43E;&#x44E; &#x454; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x430; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456;&#x441;&#x442;&#x44C;. &#x426;&#x435;&#x439; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x440;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x448;&#x440;&#x438;&#x444;&#x442;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x448;&#x440;&#x438;&#x444;&#x442;&#x430;&#x43C;&#x438; TrueType. &#x423; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x440;&#x435;&#x433;&#x456;&#x43E;&#x43D;&#x430;&#x445;, &#x439;&#x43C;&#x43E;&#x432;&#x456;&#x440;&#x43D;&#x43E;, &#x432;&#x430;&#x43C; &#x434;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; DOS OEM &#x43D;&#x430; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; ANSI Windows &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x438; <code>chcp</code>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; dos2unix &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; Windows.</p>

<p>&#x41D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x43E;&#x43C; ansi &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x43D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x456;&#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;, &#x44F;&#x43A;&#x438;&#x445; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x443; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43D;&#x435;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x432;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x435; &#x437;&#x43D;&#x430;&#x43A; &#x43F;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x43D;&#x435; &#x442;&#x43E;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;. &#x42F;&#x43A;&#x449;&#x43E; &#x443; &#x432;&#x430;&#x448;&#x456;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x456; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x456;&#x437; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43C;&#x438;, &#x44F;&#x43A;&#x456; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x43D;&#x435;&#x442;&#x438;&#x43F;&#x43E;&#x432;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x446;&#x438;&#x43C; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x43E;&#x43C;.</p>

</dd>
<dt id="unicode-unicodebom"><b>unicode, unicodebom</b></dt>
<dd>

<p>&#x41F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; unicode (&#x43D;&#x430;&#x437;&#x432;&#x430; &#x443; Windows &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16) &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;. &#x417;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;. &#x419;&#x43C;&#x43E;&#x432;&#x456;&#x440;&#x43D;&#x43E;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x448;&#x440;&#x438;&#x444;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456; TrueType &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443; &#x43D;&#x435;&#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;. &#x42F;&#x43A;&#x449;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x443; &#x448;&#x440;&#x438;&#x444;&#x442;&#x456; TrueType, &#x437;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439; &#x432;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x435; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x43A;&#x438;&#x439; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x438;&#x43A; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;, &#x456;&#x43D;&#x43E;&#x434;&#x456; &#x456;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; &#x43F;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x43D;&#x44C;&#x43E;&#x43C;&#x443;.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x454;&#x442;&#x435;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x43B;&#x44E; ConEmu, &#x432;&#x435;&#x441;&#x44C; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; ConEmu &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x431;&#x438;&#x440;&#x430;&#x454; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x438;&#x439; &#x448;&#x440;&#x438;&#x444;&#x442;.</p>

<p>&#x41D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x43E;&#x43C; unicode &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x446;&#x435; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x435; &#x437; ASCII. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x454; &#x43D;&#x435;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x44E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x435; &#x446;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x457; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x430;&#x431;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430;.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>unicodebom</code>, &#x442;&#x435;&#x43A;&#x441;&#x442; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Unicode &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x437; &#x443;&#x440;&#x430;&#x445;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; BOM (&#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x438; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;). BOM &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x442;&#x443;&#x43D;&#x435;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; PowerShell.</p>

</dd>
<dt id="utf8-utf8bom"><b>utf8, utf8bom</b></dt>
<dd>

<p>&#x41F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x43E;&#x44E; utf8 &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x446;&#x435; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x435; &#x437; ASCII. &#x412;&#x430;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x448;&#x440;&#x438;&#x444;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456; TrueType. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x448;&#x440;&#x438;&#x444;&#x442; TrueType, &#x442;&#x435;&#x43A;&#x441;&#x442; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; <code>unicode</code>.</p>

<p>&#x41D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x43E;&#x43C; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x454;&#x442;&#x435;&#x441;&#x44F; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x43C; &#x440;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x432;&#x438;&#x43C; &#x448;&#x440;&#x438;&#x444;&#x442;&#x43E;&#x43C;, &#x443;&#x441;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43F;&#x43E;&#x437;&#x430; ASCII &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43D;&#x435;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;. &#x41D;&#x435; &#x43B;&#x438;&#x448;&#x435; &#x43D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; unicode, &#x430; &#x439; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x456; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x443;&#x442;&#x44C; &#x43D;&#x435;&#x43F;&#x440;&#x438;&#x434;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;. &#x423; Windows, &#x43D;&#x430;&#x43B;&#x430;&#x448;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43D;&#x430; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x456; &#x443; &#x441;&#x445;&#x456;&#x434;&#x43D;&#x43E;-&#x430;&#x437;&#x456;&#x439;&#x441;&#x44C;&#x43A;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x433;&#x456;&#x43E;&#x43D;&#x456;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43C;&#x456;&#x442;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x435; &#x431;&#x43B;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x44C;.</p>

<p>&#x423; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456; ConEmu &#x434;&#x43E;&#x431;&#x440;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; utf8.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>utf8bom</code>, &#x442;&#x435;&#x43A;&#x441;&#x442; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x437; &#x443;&#x440;&#x430;&#x445;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; BOM (&#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x438; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;). BOM &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x442;&#x443;&#x43D;&#x435;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; PowerShell.</p>

</dd>
</dl>

<p>&#x422;&#x438;&#x43F;&#x43E;&#x432;&#x435; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x430; DOS2UNIX_DISPLAY_ENC &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>unicode</code>, <code>unicodebom</code>, <code>utf8</code> &#x430;&#x431;&#x43E; <code>utf8bom</code>.</p>

</dd>
<dt id="e---add-eol"><b>-e, --add-eol</b></dt>
<dd>

<p>&#x414;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x434;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x44F;&#x43A;&#x449;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x442;&#x430;&#x43C; &#x43D;&#x435;&#x43C;&#x430;&#x454;. &#x41F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x434;&#x43B;&#x44F; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x44C;.</p>

<p>&#x423; &#x444;&#x430;&#x439;&#x43B;&#x456;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x437; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443; DOS &#x434;&#x43E; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443; Unix &#x43C;&#x43E;&#x436;&#x435; &#x43D;&#x435; &#x432;&#x438;&#x441;&#x442;&#x430;&#x447;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x406;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x456; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x44E;&#x442;&#x44C; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x431;&#x435;&#x437; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x414;&#x435;&#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; Unix &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x43E;&#x44E; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x430; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C; POSIX &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x43C;&#x430;&#x454; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43E;&#x431;&#39;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430;&#x442;&#x438; &#x43D;&#x435; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;.</p>

</dd>
<dt id="f---force"><b>-f, --force</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43C;&#x443;&#x441;&#x43E;&#x432;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x456;&#x439;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;.</p>

</dd>
<dt id="gb---gb18030"><b>-gb, --gb18030</b></dt>
<dd>

<p>&#x423; Windows &#x444;&#x430;&#x439;&#x43B;&#x438; &#x432; UTF-16 &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x432; UTF-8, &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E;&#x457; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456;. &#x417;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x432; UTF-16 &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x443; GB18030. &#x426;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x443; Windows. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;, &#x43F;&#x440;&#x438;&#x441;&#x432;&#x44F;&#x447;&#x435;&#x43D;&#x438;&#x439; GB18030.</p>

</dd>
<dt id="h---help"><b>-h, --help</b></dt>
<dd>

<p>&#x41F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x432;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x456; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443;.</p>

</dd>
<dt id="i---info"><b>-i[&#x41F;&#x420;&#x410;&#x41F;&#x41E;&#x420;&#x426;&#x406;], --info[=&#x41F;&#x420;&#x410;&#x41F;&#x41E;&#x420;&#x426;&#x406;] &#x424;&#x410;&#x419;&#x41B; ...</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x449;&#x43E;&#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430;. &#x41D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;.</p>

<p>&#x411;&#x443;&#x434;&#x435; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x456; &#x434;&#x430;&#x43D;&#x456;, &#x443; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;: &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; DOS, &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; Unix, &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; Mac, &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x43C; &#x447;&#x438; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x43C; &#x454; &#x444;&#x430;&#x439;&#x43B; &#x442;&#x430; &#x43D;&#x430;&#x437;&#x432;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x430;.</p>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;:</p>

<pre><code> 6       0       0  no_bom    text    dos.txt
 0       6       0  no_bom    text    unix.txt
 0       0       6  no_bom    text    mac.txt
 6       6       6  no_bom    text    mixed.txt
50       0       0  UTF-16LE  text    utf16le.txt
 0      50       0  no_bom    text    utf8unix.txt
50       0       0  UTF-8     text    utf8dos.txt
 2     418     219  no_bom    binary  dos2unix.exe</code></pre>

<p>&#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x456;&#x43D;&#x43E;&#x434;&#x456; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x432;&#x43E; &#x440;&#x43E;&#x437;&#x43F;&#x456;&#x437;&#x43D;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x456;. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-s</code>.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-e</code> &#x430;&#x431;&#x43E; <code>--add-eol</code>, &#x431;&#x443;&#x434;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E; &#x434;&#x430;&#x43D;&#x456; &#x449;&#x43E;&#x434;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x430;&#x431;&#x43E; <code>noeol</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454;.</p>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;:</p>

<pre><code>6       0       0  no_bom    text   dos     dos.txt
0       6       0  no_bom    text   unix    unix.txt
0       0       6  no_bom    text   mac     mac.txt
1       0       0  no_bom    text   noeol   noeol_dos.txt</code></pre>

<p>&#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43F;&#x440;&#x430;&#x43F;&#x43E;&#x440;&#x446;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x43D;&#x435;&#x441;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D; &#x443; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456;. &#x41C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x430;&#x431;&#x43E; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43F;&#x440;&#x430;&#x43F;&#x43E;&#x440;&#x446;&#x456;&#x432;.</p>

<dl>

<dt id="pod0"><b>0</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x449;&#x43E;&#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x456;&#x437; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x430; &#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x430; &#x43D;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x426;&#x435; &#x443;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43B;&#x44E;&#x454; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x443; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x446;&#x456;&#x44E; &#x43D;&#x430;&#x437;&#x432; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x438; &#x430;&#x431;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43B;&#x430;&#x43F;&#x43E;&#x43A;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x43F;&#x43E;&#x440;&#x435;&#x446;&#x44C; &laquo;c&raquo;. &#x421;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x446;&#x438;&#x43C; &#x43F;&#x440;&#x430;&#x43F;&#x43E;&#x440;&#x446;&#x435;&#x43C; &#x443; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x456; &#x456;&#x437; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>-0</code> &#x430;&#x431;&#x43E; <code>--null</code> xargs(1).</p>

</dd>
<dt id="d"><b>d</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; DOS.</p>

</dd>
<dt id="u"><b>u</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; Unix.</p>

</dd>
<dt id="m"><b>m</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; Mac.</p>

</dd>
<dt id="b"><b>b</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;.</p>

</dd>
<dt id="t"><b>t</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x449;&#x43E;&#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x454; &#x444;&#x430;&#x439;&#x43B; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x43C; &#x447;&#x438; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x43C;.</p>

</dd>
<dt id="e"><b>e</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x442;&#x438;&#x43F; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x430;&#x431;&#x43E; <code>noeol</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43D;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;.</p>

</dd>
<dt id="c"><b>c</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x43B;&#x43E; &#x431; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E;.</p>

<p>&#x406;&#x437; &#x43F;&#x440;&#x430;&#x43F;&#x43E;&#x440;&#x446;&#x435;&#x43C; <code>c</code> dos2unix &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x43B;&#x438;&#x448;&#x435; &#x43D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x443; &#x44F;&#x43A;&#x438;&#x445; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS. unix2dos &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x43B;&#x438;&#x448;&#x435; &#x43D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x443; &#x44F;&#x43A;&#x438;&#x445; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-e</code> &#x430;&#x431;&#x43E; <code>--add-eol</code>, &#x431;&#x443;&#x434;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;.</p>

</dd>
<dt id="h"><b>h</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A;.</p>

</dd>
<dt id="p"><b>p</b></dt>
<dd>

<p>&#x41F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x431;&#x435;&#x437; &#x448;&#x43B;&#x44F;&#x445;&#x456;&#x432;.</p>

</dd>
</dl>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438;:</p>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x449;&#x43E;&#x434;&#x43E; &#x443;&#x441;&#x456;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; *.txt:</p>

<pre><code>dos2unix -i *.txt</code></pre>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; DOS &#x456; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; Unix:</p>

<pre><code>dos2unix -idu *.txt</code></pre>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;:</p>

<pre><code>dos2unix --info=b *.txt</code></pre>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x443; &#x44F;&#x43A;&#x438;&#x445; &#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS:</p>

<pre><code>dos2unix -ic *.txt</code></pre>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x443; &#x44F;&#x43A;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix:</p>

<pre><code>unix2dos -ic *.txt</code></pre>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x443; &#x44F;&#x43A;&#x438;&#x445; &#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS &#x430;&#x431;&#x43E; &#x44F;&#x43A;&#x44B; &#x43D;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;:</p>

<pre><code>dos2unix -e -ic *.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x456;&#x437; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS &#x456; &#x43D;&#x435; &#x447;&#x456;&#x43F;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;:</p>

<pre><code>dos2unix -ic0 *.txt | xargs -0 dos2unix</code></pre>

<p>&#x417;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x456; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS:</p>

<pre><code>find -name &#39;*.txt&#39; -print0 | xargs -0 dos2unix -ic</code></pre>

</dd>
<dt id="k---keepdate"><b>-k, --keepdate</b></dt>
<dd>

<p>&#x417;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x447;&#x430;&#x441;&#x43E;&#x432;&#x443; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;.</p>

</dd>
<dt id="L---license"><b>-L, --license</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x443;&#x43C;&#x43E;&#x432;&#x438; &#x43B;&#x456;&#x446;&#x435;&#x43D;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;.</p>

</dd>
<dt id="l---newline"><b>-l, --newline</b></dt>
<dd>

<p>&#x412;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;.</p>

<p><b>dos2unix</b>: &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x434;&#x432;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x430;&#x446;&#x456;&#x439; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS. &#x423; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; Mac &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x434;&#x432;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix &#x43B;&#x438;&#x448;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Mac.</p>

<p><b>unix2dos</b>: &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x434;&#x432;&#x456; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x430;&#x446;&#x456;&#x457; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS. &#x423; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; Mac &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x434;&#x432;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Mac &#x43B;&#x438;&#x448;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix.</p>

</dd>
<dt id="m---add-bom"><b>-m, --add-bom</b></dt>
<dd>

<p>&#x417;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM). &#x422;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; UTF-8.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x434;&#x430;&#x43D;&#x456; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x437;&#x430;&#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x443; UTF-16 &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-u</code>, &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; UTF-16.</p>

<p>&#x41D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x446;&#x435;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;, &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x432;&#x456;&#x434; UTF-8, UTF-16 &#x430;&#x431;&#x43E; GB18030. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; &#x449;&#x43E;&#x434;&#x43E; UNICODE.</p>

</dd>
<dt id="n---newfile-_-_"><b>-n, --newfile &#x412;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B; &#x412;&#x418;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B; ...</b></dt>
<dd>

<p>&#x41D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x437; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x412;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x412;&#x418;&#x425;&#x406;&#x414;&#x41D;&#x418;&#x419;_&#x424;&#x410;&#x419;&#x41B;. &#x41D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x441;&#x43B;&#x456;&#x434; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x438;, <i>&#x43D;&#x435; &#x441;&#x43B;&#x456;&#x434;</i> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;, &#x456;&#x43D;&#x430;&#x43A;&#x448;&#x435; &#x432;&#x43C;&#x456;&#x441;&#x442; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; <i>&#x431;&#x443;&#x434;&#x435; &#x432;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43D;&#x43E;</i>.</p>

<p>&#x412;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430;, &#x44F;&#x43A;&#x438;&#x43C; &#x431;&#x443;&#x43B;&#x43E; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; (&#x43F;&#x430;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;). &#x41F;&#x440;&#x430;&#x432;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x43D;&#x430; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x456; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x43C;&#x456;&#x43D;&#x443;&#x441; umask(1) &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430;, &#x44F;&#x43A;&#x438;&#x43C; &#x431;&#x443;&#x43B;&#x43E; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;.</p>

</dd>
<dt id="no-allow-chown"><b>--no-allow-chown</b></dt>
<dd>

<p>&#x41D;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x443; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; (&#x442;&#x438;&#x43F;&#x43E;&#x432;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430;).</p>

<p>&#x41F;&#x435;&#x440;&#x435;&#x440;&#x438;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x443; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43D;&#x435; &#x432;&#x434;&#x430;&#x441;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x434;&#x43E; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430; &#x456;/&#x430;&#x431;&#x43E; &#x433;&#x440;&#x443;&#x43F;&#x438;. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; <code>-o</code> &#x456; <code>-n</code>. &#x426;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x43B;&#x438;&#x448;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x443; dos2unix &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430;&#x43C; &#x456; &#x433;&#x440;&#x443;&#x43F;&#x430;&#x43C;.</p>

</dd>
<dt id="no-add-eol"><b>--no-add-eol</b></dt>
<dd>

<p>&#x41D;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x434;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x44F;&#x43A;&#x449;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x442;&#x430;&#x43C; &#x43D;&#x435;&#x43C;&#x430;&#x454;.</p>

</dd>
<dt id="O---to-stdout"><b>-O, --to-stdout</b></dt>
<dd>

<p>&#x417;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F;, &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43E; &#x444;&#x456;&#x43B;&#x44C;&#x442;&#x440;&#x430; Unix. &#x421;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>-o</code>, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44F; &#x434;&#x43E; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x430; (&#x43D;&#x430; &#x43C;&#x456;&#x441;&#x446;&#x456;).</p>

<p>&#x423; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x456; &#x456;&#x437; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>-e</code> &#x444;&#x430;&#x439;&#x43B;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x440;&#x43E;&#x437;&#x440;&#x456;&#x437;&#x430;&#x442;&#x438;. &#x423;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x431;&#39;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#39;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x456; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x456; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43E;&#x43A; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; Unicode. &#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>

<pre><code>dos2unix -e -O &#x444;&#x430;&#x439;&#x43B;1.txt &#x444;&#x430;&#x439;&#x43B;2.txt &gt; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;.txt</code></pre>

</dd>
<dt id="o---oldfile"><b>-o, --oldfile &#x424;&#x410;&#x419;&#x41B; ...</b></dt>
<dd>

<p>&#x417;&#x430;&#x441;&#x442;&#x430;&#x440;&#x456;&#x43B;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438;. &#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x424;&#x410;&#x419;&#x41B; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x43C;&#x456;&#x441;&#x442;. &#x422;&#x438;&#x43F;&#x43E;&#x432;&#x43E;, &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;. &#x41C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;.</p>

<p>&#x423; &#x437;&#x430;&#x441;&#x442;&#x430;&#x440;&#x456;&#x43B;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; (&#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x437;&#x430;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F;) &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x442;&#x43E;&#x43C;&#x443; &#x441;&#x430;&#x43C;&#x43E;&#x43C;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x443; &#x456; &#x433;&#x440;&#x443;&#x43F;&#x456; &#x456; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x442;&#x456; &#x441;&#x430;&#x43C;&#x456; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x43D;&#x430; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;, &#x449;&#x43E; &#x456; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x435;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x454; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x43D;&#x430; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x435;&#x43C; root), &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x432;&#x430;&#x43D;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x434;&#x430;&#x441;&#x442;&#x44C;&#x441;&#x44F;. &#x417;&#x43C;&#x456;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x434;&#x43B;&#x44F; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430;. &#x417;&#x43C;&#x456;&#x43D;&#x430; &#x433;&#x440;&#x443;&#x43F;&#x438; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x456;&#x437; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x43A;&#x43E;&#x44E;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x444;&#x430;&#x439;&#x43B; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430;&#x43C;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x43C;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x456; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443;. &#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x432; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x430; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x443; Unix.</p>

<p>&#x429;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x443; dos2unix &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x456; &#x433;&#x440;&#x443;&#x43F;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x432;&#x456;&#x434;&#x434;&#x430;&#x439;&#x442;&#x435; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; <code>dos2unix -V</code>.</p>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43E;, &#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43E; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E;, &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x43E; &#x43D;&#x430; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x41C;&#x43E;&#x436;&#x435; &#x442;&#x430;&#x43A; &#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x449;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x445; &#x441;&#x430;&#x43C;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x434;&#x43B;&#x44F; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x44C; &#x441;&#x43E;&#x431;&#x43E;&#x44E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x443; &#x456;/&#x430;&#x431;&#x43E; &#x433;&#x440;&#x443;&#x43F;&#x456;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>--allow-chown</code>, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43C;&#x43E;&#x433;&#x43B;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445;:</p>

<pre><code>dos2unix --allow-chown &#x44F;&#x43A;&#x438;&#x439;&#x441;&#x44C;.txt</code></pre>

<p>&#x406;&#x43D;&#x448;&#x438;&#x43C; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x43E;&#x43C; &#x434;&#x456;&#x439; &#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;:</p>

<pre><code>dos2unix -n &#x44F;&#x43A;&#x438;&#x439;&#x441;&#x44C;.txt &#x44F;&#x43A;&#x438;&#x439;&#x441;&#x44C;.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x43E;&#x44E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; <code>--allow-chown</code> &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;-&#x437;&#x430;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438;, &#x430; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x431;&#x443;&#x434;&#x435; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;.</p>

</dd>
<dt id="q---quiet"><b>-q, --quiet</b></dt>
<dd>

<p>&#x420;&#x435;&#x436;&#x438;&#x43C; &#x431;&#x435;&#x437; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x44C;. &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43D;&#x435; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x43C;&#x435; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x436;&#x435;&#x43D;&#x44C; &#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x41F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x443;&#x43B;&#x44C;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;.</p>

</dd>
<dt id="r---remove-bom"><b>-r, --remove-bom</b></dt>
<dd>

<p>&#x412;&#x438;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM). &#x41D;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; BOM &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;. &#x426;&#x435; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x437; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x43E;&#x43C; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-b</code>.</p>

</dd>
<dt id="s---safe"><b>-s, --safe</b></dt>
<dd>

<p>&#x41F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x434;&#x432;&#x456;&#x439;&#x43A;&#x43E;&#x432;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; (&#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E;).</p>

<p>&#x41F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x43D;&#x43D;&#x44F; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;. &#x41C;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43D;&#x435; &#x454; 100% &#x442;&#x43E;&#x447;&#x43D;&#x438;&#x43C;. &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x448;&#x443;&#x43A;&#x430;&#x454; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x43D;&#x435; &#x442;&#x440;&#x430;&#x43F;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445;. &#x41C;&#x43E;&#x436;&#x435; &#x442;&#x430;&#x43A; &#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x449;&#x43E; &#x443; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x432;&#x43E; &#x441;&#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43E;&#x44E; &#x44F;&#x43A; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x439;.</p>

</dd>
<dt id="u---keep-utf16"><b>-u, --keep-utf16</b></dt>
<dd>

<p>&#x417;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x435; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16. &#x424;&#x430;&#x439;&#x43B; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x441;&#x430;&#x43C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-16, &#x456;&#x437; &#x43F;&#x440;&#x44F;&#x43C;&#x438;&#x43C; &#x430;&#x431;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x456; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x430;&#x43F;&#x43E;&#x431;&#x456;&#x433;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44E; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-8. &#x414;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x443; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; UTF-16. &#x412;&#x438;&#x43C;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; <code>-ascii</code>.</p>

</dd>
<dt id="ul---assume-utf16le"><b>-ul, --assume-utf16le</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x454; UTF-16LE.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x443; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; &#x454; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM), &#x457;&#x457; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;-&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C;&#x438; &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x449;&#x43E;&#x434;&#x43E; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x430; (&#x444;&#x430;&#x439;&#x43B; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x43D;&#x435; &#x454; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x43C; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; UTF-16LE), &#x456; &#x434;&#x430;&#x43D;&#x456; &#x432;&#x434;&#x430;&#x441;&#x442;&#x44C;&#x441;&#x44F; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438;, &#x432;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454;&#x442;&#x435; &#x444;&#x430;&#x439;&#x43B; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 &#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x43E;&#x43C;. &#x421;&#x43A;&#x430;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; iconv(1) &#x437; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; UTF-8 &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; UTF-16LE. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x432;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x435;&#x441;&#x44F; &#x434;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;.</p>

<p>&#x41F;&#x440;&#x438;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x449;&#x43E;&#x434;&#x43E; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16LE &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x44F;&#x43A; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <i>&#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;</i>. &#x41F;&#x435;&#x440;&#x435;&#x43C;&#x438;&#x43A;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x430; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; <i>ascii</i> &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43C;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x449;&#x43E;&#x434;&#x43E; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16LE.</p>

</dd>
<dt id="ub---assume-utf16be"><b>-ub, --assume-utf16be</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x43E;&#x43C; &#x454; UTF-16BE.</p>

<p>&#x426;&#x435;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x443; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431;, &#x442;&#x43E;&#x442;&#x43E;&#x436;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; <code>-ul</code>.</p>

</dd>
<dt id="v---verbose"><b>-v, --verbose</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x411;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x449;&#x43E;&#x434;&#x43E; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43E;&#x43A; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;.</p>

</dd>
<dt id="F---follow-symlink"><b>-F, --follow-symlink</b></dt>
<dd>

<p>&#x41F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x437;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x43D;&#x430; &#x44F;&#x43A;&#x456; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;.</p>

</dd>
<dt id="R---replace-symlink"><b>-R, --replace-symlink</b></dt>
<dd>

<p>&#x417;&#x430;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x43C;&#x438; (&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x43D;&#x430; &#x44F;&#x43A;&#x456; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;, &#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;).</p>

</dd>
<dt id="S---skip-symlink"><b>-S, --skip-symlink</b></dt>
<dd>

<p>&#x41D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x43D;&#x430; &#x44F;&#x43A;&#x456; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; (&#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E;).</p>

</dd>
<dt id="V---version"><b>-V, --version</b></dt>
<dd>

<p>&#x412;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x449;&#x43E;&#x434;&#x43E; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x456; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443;.</p>

</dd>
</dl>

<h1 id="MAC">&#x420;&#x415;&#x416;&#x418;&#x41C; MAC</h1>

<p>&#x422;&#x438;&#x43F;&#x43E;&#x432;&#x43E;, &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix, &#x456; &#x43D;&#x430;&#x432;&#x43F;&#x430;&#x43A;&#x438;. &#x420;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Mac &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44E; &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x43B;&#x44F;&#x433;&#x430;&#x44E;&#x442;&#x44C;.</p>

<p>&#x423; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; Mac &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Mac &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; Unix, &#x456; &#x43D;&#x430;&#x432;&#x43F;&#x430;&#x43A;&#x438;. &#x420;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44E; &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x43B;&#x44F;&#x433;&#x430;&#x44E;&#x442;&#x44C;.</p>

<p>&#x429;&#x43E;&#x431; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; Mac, &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430; <code>-c mac</code> &#x430;&#x431;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;&#x43C;&#x438; <code>mac2unix</code> &#x442;&#x430; <code>unix2mac</code>.</p>

<h1 id="4">&#x420;&#x415;&#x416;&#x418;&#x41C;&#x418; &#x41F;&#x415;&#x420;&#x415;&#x422;&#x412;&#x41E;&#x420;&#x415;&#x41D;&#x41D;&#x42F;</h1>

<dl>

<dt id="ascii1"><b>ascii</b></dt>
<dd>

<p>&#x426;&#x435; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;. &#x426;&#x435;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; ASCII &#x430;&#x431;&#x43E; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x43E;&#x43C;&#x443; &#x437; ASCII &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456;, &#x437;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430; UTF-8. &#x412;&#x43C;&#x438;&#x43A;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; <b>ascii</b> &#x432;&#x438;&#x43C;&#x438;&#x43A;&#x430;&#x454; &#x440;&#x435;&#x436;&#x438;&#x43C; <b>7bit</b> &#x456; <b>iso</b>.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x443; dos2unix &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; UTF-16, &#x444;&#x430;&#x439;&#x43B;&#x438; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-16 &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x434;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456; &#x443; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445; POSIX &#x442;&#x430; &#x434;&#x43E; UTF-8 &#x443; Windows. &#x412;&#x43C;&#x438;&#x43A;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; <b>ascii</b> &#x432;&#x438;&#x43C;&#x438;&#x43A;&#x430;&#x454; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16 (<code>-u</code>) &#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;, &#x44F;&#x43A;&#x456; &#x43D;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x43C;&#x43E;&#x433;&#x443; &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x437;&#x430;&#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x432; UTF-16 (<code>-ul</code> &#x456; <code>-ub</code>). &#x429;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x443; dos2unix &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; UTF-16, &#x432;&#x432;&#x435;&#x434;&#x456;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; <code>dos2unix -V</code>. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; UNICODE.</p>

</dd>
<dt id="bit"><b>7bit</b></dt>
<dd>

<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x443;&#x441;&#x456; 8-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; ASCII, (&#x437; &#x43D;&#x43E;&#x43C;&#x435;&#x440;&#x430;&#x43C;&#x438; &#x432;&#x456;&#x434; 128 &#x434;&#x43E; 255) &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456; 7-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;.</p>

</dd>
<dt id="iso1"><b>iso</b></dt>
<dd>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43E; &#x437; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; (&#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x43E;&#x457; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x438;) DOS &#x434;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; ISO-8859-1 (Latin-1) &#x443; Unix. &#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; DOS, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x443; ISO-8859-1 &#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x438;&#x445; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x435;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x43D;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x438;. &#x422;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; ISO-8859-1, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x443; DOS.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-iso</code>, &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; dos2unix &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x446;&#x435; &#x432;&#x438;&#x44F;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C;, dos2unix &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x454; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x435; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; CP437, &#x44F;&#x43A;&#x435; &#x437;&#x434;&#x435;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x421;&#x428;&#x410;. &#x429;&#x43E;&#x431; &#x43F;&#x440;&#x438;&#x43C;&#x443;&#x441;&#x43E;&#x432;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>-437</code> (&#x421;&#x428;&#x410;), <code>-850</code> (&#x437;&#x430;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x454;&#x432;&#x440;&#x43E;&#x43F;&#x435;&#x439;&#x441;&#x44C;&#x43A;&#x456; &#x43C;&#x43E;&#x432;&#x438;), <code>-860</code> (&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x433;&#x430;&#x43B;&#x44C;&#x441;&#x44C;&#x43A;&#x430;), <code>-863</code> (&#x43A;&#x430;&#x43D;&#x430;&#x434;&#x441;&#x44C;&#x43A;&#x430; &#x444;&#x440;&#x430;&#x43D;&#x446;&#x443;&#x437;&#x44C;&#x43A;&#x430;) &#x430;&#x431;&#x43E; <code>-865</code> (&#x441;&#x43A;&#x430;&#x43D;&#x434;&#x438;&#x43D;&#x430;&#x432;&#x441;&#x44C;&#x43A;&#x456; &#x43C;&#x43E;&#x432;&#x438;). &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; Windows CP1252 (&#x437;&#x430;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x454;&#x432;&#x440;&#x43E;&#x43F;&#x435;&#x439;&#x441;&#x44C;&#x43A;&#x456; &#x43C;&#x43E;&#x432;&#x438;) &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; <code>-1252</code>. &#x414;&#x43B;&#x44F; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; dos2unix &#x437; iconv(1). &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; iconv &#x437;&#x434;&#x430;&#x442;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x456; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x43E;&#x43C;&#x443; &#x441;&#x43F;&#x435;&#x43A;&#x442;&#x440;&#x456; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;.</p>

<p>&#x41D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; ISO &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; Unicode. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x443;&#x448;&#x43A;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8.</p>

<p>&#x414;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432;:</p>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; DOS &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Latin-1 Unix:</p>

<pre><code>dos2unix -iso -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; DOS CP850 &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Latin-1 Unix:</p>

<pre><code>dos2unix -850 -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; CP1252 Windows &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Latin-1 Unix:</p>

<pre><code>dos2unix -1252 -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; CP252 Windows &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 Unix (Unicode):</p>

<pre><code>iconv -f CP1252 -t UTF-8 in.txt | dos2unix &gt; out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Latin-1 Unix &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; DOS:</p>

<pre><code>unix2dos -iso -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Latin-1 Unix &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; DOS CP850:</p>

<pre><code>unix2dos -850 -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Latin-1 Unix &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Windows CP1252:</p>

<pre><code>unix2dos -1252 -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 Unix (Unicode) &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Windows CP1252:</p>

<pre><code>unix2dos &lt; in.txt | iconv -f UTF-8 -t CP1252 &gt; out.txt</code></pre>

<p>&#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; <a href="http://czyborra.com/charsets/codepages.html">http://czyborra.com/charsets/codepages.html</a> &#x442;&#x430; <a href="http://czyborra.com/charsets/iso8859.html">http://czyborra.com/charsets/iso8859.html</a>.</p>

</dd>
</dl>

<h1 id="UNICODE">UNICODE</h1>

<h2 id="5">&#x41A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>

<p>&#x406;&#x441;&#x43D;&#x443;&#x454; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x44C; Unicode. &#x423; Unix &#x442;&#x430; Linux &#x443; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; Unicode &#x437;&#x434;&#x435;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-8. &#x423; Windows &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; Unicode &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-8, UTF-16 &#x430;&#x431;&#x43E; UTF-16 &#x437;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;. &#x412;&#x442;&#x456;&#x43C;, &#x437;&#x434;&#x435;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; UTF-16.</p>

<h2 id="6">&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;</h2>

<p>&#x423; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; Unicode, &#x44F;&#x43A; &#x456; &#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; ASCII, &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x438;&#x432;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; DOS, Unix &#x430;&#x431;&#x43E; Mac.</p>

<p>&#x423;&#x441;&#x456; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; dos2unix &#x442;&#x430; unix2dos &#x437;&#x434;&#x430;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; UTF-8 &#x431;&#x443;&#x43B;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x442;&#x430;&#x43A;, &#x449;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x443; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x437; ASCII &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43E;.</p>

<p>&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; dos2unix &#x442;&#x430; unix2dos, &#x437;&#x456;&#x431;&#x440;&#x430;&#x43D;&#x456; &#x437; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x43E;&#x44E; Unicode UTF-16, &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-16 &#x437; &#x43F;&#x440;&#x44F;&#x43C;&#x438;&#x43C; &#x442;&#x430; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;. &#x429;&#x43E;&#x431; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x447;&#x438; &#x431;&#x443;&#x43B;&#x43E; dos2unix &#x437;&#x456;&#x431;&#x440;&#x430;&#x43D;&#x43E; &#x437; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x43E;&#x44E; UTF-16, &#x432;&#x456;&#x434;&#x434;&#x430;&#x439;&#x442;&#x435; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; <code>dos2unix -V</code>.</p>

<p>&#x423; Unix/Linux &#x444;&#x430;&#x439;&#x43B;&#x438; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-16 &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456;. &#x414;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x44E; locale(1). &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x44F;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C;, &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x456; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B;.</p>

<p>&#x423; Windows &#x444;&#x430;&#x439;&#x43B;&#x438; UTF-16 &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438; UTF-8. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x442;&#x438;&#x43F;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;, Windows &#x442;&#x430; Unix/Linux, &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x435;&#x43F;&#x43E;&#x433;&#x430;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8.</p>

<p>&#x41A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16 &#x442;&#x430; UTF-8 &#x454; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x438;&#x43C;&#x438;. &#x41F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x457; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-16 &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 &#x442;&#x440;&#x430;&#x43F;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x443; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; UTF-16 &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A;&#x430;&#x441;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x444;&#x430;&#x439;&#x43B; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x43E;.</p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-u</code>, &#x444;&#x430;&#x439;&#x43B; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x441;&#x430;&#x43C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-16, &#x449;&#x43E; &#x456; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; Option <code>-u</code> &#x437;&#x430;&#x43F;&#x43E;&#x431;&#x456;&#x433;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44E; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-8.</p>

<p>&#x423; dos2unix &#x442;&#x430; unix2dos &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-16.</p>

<p>&#x420;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; ISO &#x442;&#x430; 7-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43D;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; UTF-16.</p>

<h2 id="7">&#x41F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;</h2>

<p>&#x423; Windows &#x434;&#x43E; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Unicode &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x434;&#x43E;&#x43F;&#x438;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM), &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C; Windows (&#x437;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430; Notepad) &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x443; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E;. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; <a href="https://en.wikipedia.org/wiki/Byte_order_mark">https://en.wikipedia.org/wiki/Byte_order_mark</a>.</p>

<p>&#x423; Unix &#x444;&#x430;&#x439;&#x43B;&#x438; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Unicode &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E; &#x43D;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x438; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;. &#x412;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x454; &#x442;&#x435; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x44E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x43B;&#x44E;.</p>

<p>&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; dos2unix &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x454; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x444;&#x430;&#x439;&#x43B;&#x430; UTF-16, &#x43B;&#x438;&#x448;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;. &#x42F;&#x43A;&#x449;&#x43E; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;, &#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x43E;&#x457; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x438;, dos2unix &#x432;&#x432;&#x430;&#x436;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x434;&#x432;&#x456;&#x439;&#x43A;&#x43E;&#x432;&#x438;&#x43C; (&#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x43C;).</p>

<p>&#x414;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; UTF-16 &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x438; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>-ul</code> &#x430;&#x431;&#x43E; <code>-ub</code>.</p>

<p>&#x422;&#x438;&#x43F;&#x43E;&#x432;&#x43E; dos2unix &#x43D;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x438; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM). &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-b</code>, dos2unix &#x437;&#x430;&#x43F;&#x438;&#x448;&#x435; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432; BOM, &#x44F;&#x43A;&#x449;&#x43E; BOM &#x431;&#x443;&#x43B;&#x430; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445;.</p>

<p>&#x422;&#x438;&#x43F;&#x43E;&#x432;&#x43E; unix2dos &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM) &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x449;&#x43E; BOM &#x454; &#x443; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;. &#x421;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>-r</code>, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x438; BOM.</p>

<p>Dos2unix &#x442;&#x430; unix2dos &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x44E;&#x442;&#x44C; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM), &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-m</code>.</p>

<h2 id="Unicode-Windows">&#x41D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; Unicode &#x443; Windows</h2>

<p>&#x423; dos2unix &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x43D;&#x430;&#x437;&#x432; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; Unicode &#x443; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; Windows. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; dos2unix &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x443; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x445; &#x44F;&#x43A;&#x438;&#x445; &#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x43E;&#x457; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x43E;&#x457; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x43E;&#x457; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x438; ANSI. &#x429;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x437;&#x456;&#x431;&#x440;&#x430;&#x43D;&#x43E; dos2unix &#x434;&#x43B;&#x44F; Windows &#x437; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x43E;&#x44E; &#x43D;&#x430;&#x437;&#x432; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Unicode, &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x44E; <code>dos2unix -V</code>.</p>

<p>&#x406;&#x437; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x43E;&#x43C; &#x43D;&#x430;&#x437;&#x432; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Unicode &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456; Windows &#x43F;&#x43E;&#x432;&rsquo;&#x44F;&#x437;&#x430;&#x43D;&#x43E; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;. &#x414;&#x438;&#x432;. &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-D</code>, <code>--display-enc</code>. &#x41D;&#x430;&#x437;&#x432;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43D;&#x435;&#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456;, &#x430;&#x43B;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x446;&#x438;&#x445; &#x43D;&#x430;&#x437;&#x432; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;.</p>

<h2 id="Unicode">&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x434;&#x43B;&#x44F; Unicode</h2>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x437; Windows UTF-16 (&#x437; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x43E;&#x44E; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (BOM)) &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; Unix UTF-8:</p>

<pre><code>dos2unix -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; Windows UTF-16LE (&#x431;&#x435;&#x437; BOM) &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; UTF-8 Unix:</p>

<pre><code>dos2unix -ul -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 Unix &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Windows UTF-8 &#x431;&#x435;&#x437; BOM:</p>

<pre><code>unix2dos -m -n in.txt out.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; UTF-8 Unix &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Windows UTF-16:</p>

<pre><code>unix2dos &lt; in.txt | iconv -f UTF-8 -t UTF-16 &gt; out.txt</code></pre>

<h1 id="GB18030">GB18030</h1>

<p>GB18030 &#x454; &#x43A;&#x438;&#x442;&#x430;&#x439;&#x441;&#x44C;&#x43A;&#x438;&#x43C; &#x443;&#x440;&#x44F;&#x434;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C;. &#x41F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430; &#x43E;&#x431;&#x43E;&#x432;&rsquo;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x43E;&#x457; &#x43F;&#x456;&#x434;&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x443; GB18030 &#x454; &#x43D;&#x435;&#x43E;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x44E; &#x432;&#x438;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x434;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x41A;&#x438;&#x442;&#x430;&#x457;. &#x414;&#x438;&#x432;. &#x442;&#x430;&#x43A;&#x43E;&#x436; <a href="https://en.wikipedia.org/wiki/GB_18030">https://en.wikipedia.org/wiki/GB_18030</a>.</p>

<p>&#x41A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; GB18030 &#x454; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x438;&#x43C; &#x456;&#x437; Unicode. &#x419;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438; &#x44F;&#x43A; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; unicode. &#x41F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E; UTF-8, GB18030 &#x454; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x438;&#x43C; &#x456;&#x437; ASCII. GB18030 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x454; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x438;&#x43C; &#x456;&#x437; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x43E;&#x44E; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x43E;&#x44E; Windows 936, &#x44F;&#x43A;&#x443; &#x449;&#x435; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C; GBK.</p>

<p>&#x423; Unix/Linux &#x444;&#x430;&#x439;&#x43B;&#x438; UTF-16 &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x434;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; GB18030, &#x44F;&#x43A;&#x449;&#x43E; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456; &#x454; GB18030. &#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x446;&#x435; &#x441;&#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x43B;&#x438;&#x448;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x443; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x456;. &#x429;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x435;&#x439;, &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x44E; <code>locale -a</code>.</p>

<p>&#x423; Windows &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; UTF-16 &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438; GB18030 &#x441;&#x43B;&#x456;&#x434; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>-gb</code>.</p>

<p>&#x423; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; GB18030 &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; &#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; Unicode.</p>

<h1 id="8">&#x41F;&#x420;&#x418;&#x41A;&#x41B;&#x410;&#x414;&#x418;</h1>

<p>&#x41F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x432;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x437;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x436;&#x435;&#x440;&#x435;&#x43B;&#x430; (stdin) &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x434;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; (stdout):</p>

<pre><code>dos2unix &lt; a.txt
cat a.txt | dos2unix</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; a.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; b.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x444;&#x430;&#x439;&#x43B;:</p>

<pre><code>dos2unix a.txt b.txt
dos2unix -o a.txt b.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; a.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; ascii:</p>

<pre><code>dos2unix a.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; a.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; ascii. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; b.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; 7-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;:</p>

<pre><code>dos2unix a.txt -c 7bit b.txt
dos2unix -c ascii a.txt -c 7bit b.txt
dos2unix -ascii a.txt -7 b.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B; a.txt &#x437; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443; Mac &#x43D;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; Unix:</p>

<pre><code>dos2unix -c mac a.txt
mac2unix a.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B; a.txt &#x437; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443; Unix &#x43D;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; Mac:</p>

<pre><code>unix2dos -c mac a.txt
unix2mac a.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; a.txt, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x456; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x447;&#x430;&#x441;&#x43E;&#x432;&#x443; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430;:</p>

<pre><code>dos2unix -k a.txt
dos2unix -k -o a.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; a.txt &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; e.txt:</p>

<pre><code>dos2unix -n a.txt e.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; a.txt &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; e.txt. &#x421;&#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x447;&#x430;&#x441;&#x43E;&#x432;&#x443; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43A;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x430; a.txt &#x434;&#x43B;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x430; e.txt:</p>

<pre><code>dos2unix -k -n a.txt e.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; a.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; b.txt &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x434;&#x43E; e.txt:</p>

<pre><code>dos2unix a.txt -n b.txt e.txt
dos2unix -o a.txt -n b.txt e.txt</code></pre>

<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; c.txt &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43E; e.txt. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; a.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43D;&#x438;&#x43C;&#x438; &#x446;&#x435;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; b.txt &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43D;&#x438;&#x43C;&#x438; &#x446;&#x435;&#x439; &#x444;&#x430;&#x439;&#x43B;. &#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x443; d.txt &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43E; f.txt:</p>

<pre><code>dos2unix -n c.txt e.txt -o a.txt b.txt -n d.txt f.txt</code></pre>

<h1 id="9">&#x420;&#x415;&#x41A;&#x423;&#x420;&#x421;&#x418;&#x412;&#x41D;&#x415; &#x41F;&#x415;&#x420;&#x415;&#x422;&#x412;&#x41E;&#x420;&#x415;&#x41D;&#x41D;&#x42F;</h1>

<p>&#x423; &#x43E;&#x431;&#x43E;&#x43B;&#x43E;&#x43D;&#x446;&#x456; UNIX &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x430;&#x43C;&#x438; find(1) &#x456; xargs(1) &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; dos2unix &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x443;&#x441;&#x456;&#x445; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x456;&#x454;&#x440;&#x430;&#x440;&#x445;&#x456;&#x457; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x443;&#x441;&#x456;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; .txt &#x443; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x456; &#x43F;&#x456;&#x434;&#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x456;&#x432; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x443;, &#x432;&#x456;&#x434;&#x434;&#x430;&#x439;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x443; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443;:</p>

<pre><code>find . -name &#39;*.txt&#39; -print0 |xargs -0 dos2unix</code></pre>

<p>&#x41F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; find(1) <code>-print0</code> &#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; xargs(1) <code>-0</code> &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x443; &#x43D;&#x430;&#x437;&#x432;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x454; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x438; &#x430;&#x431;&#x43E; &#x43B;&#x430;&#x43F;&#x43A;&#x438;. &#x406;&#x43D;&#x430;&#x43A;&#x448;&#x435;, &#x446;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438;. &#x406;&#x43D;&#x448;&#x438;&#x43C; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x43E;&#x43C; &#x434;&#x456;&#x439; &#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; find(1) &#x437; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <code>-exec</code>:</p>

<pre><code>find . -name &#39;*.txt&#39; -exec dos2unix {} \;</code></pre>

<p>&#x423; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; Windows &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x44E;:</p>

<pre><code>for /R %G in (*.txt) do dos2unix &quot;%G&quot;</code></pre>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x456; PowerShell &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x44E; &#x443; Windows PowerShell:</p>

<pre><code>get-childitem -path . -filter &#39;*.txt&#39; -recurse | foreach-object {dos2unix $_.Fullname}</code></pre>

<h1 id="10">&#x41B;&#x41E;&#x41A;&#x410;&#x41B;&#x406;&#x417;&#x410;&#x426;&#x406;&#x42F;</h1>

<dl>

<dt id="LANG"><b>LANG</b></dt>
<dd>

<p>&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430; &#x43C;&#x43E;&#x432;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x430; LANG. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; LANG &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;. &#x41F;&#x435;&#x440;&#x448;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x430;&#x43B;&#x438;&#x43C;&#x438; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43C;&#x438; &#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x43A;&#x43E;&#x434; &#x43C;&#x43E;&#x432;&#x438;. &#x414;&#x440;&#x443;&#x433;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x454; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&rsquo;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x43E;&#x44E;, &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x43A;&#x43E;&#x434; &#x43A;&#x440;&#x430;&#x457;&#x43D;&#x438; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x43F;&#x438;&#x441;&#x43D;&#x438;&#x43C;&#x438; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43C;&#x438;, &#x432;&#x456;&#x434;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x457; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x43F;&#x456;&#x434;&#x43A;&#x440;&#x435;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&rsquo;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x443; &#x442;&#x440;&#x435;&#x442;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443;: &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x426;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x457; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x43E;&#x44E;. &#x41E;&#x441;&#x44C; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x43E;&#x43B;&#x43E;&#x43D;&#x43E;&#x43A; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; POSIX:</p>

<pre><code>export LANG=uk               &#x443;&#x43A;&#x440;&#x430;&#x457;&#x43D;&#x441;&#x44C;&#x43A;&#x430;
export LANG=uk_UA            &#x443;&#x43A;&#x440;&#x430;&#x457;&#x43D;&#x441;&#x44C;&#x43A;&#x430;, &#x423;&#x43A;&#x440;&#x430;&#x457;&#x43D;&#x430;
export LANG=ru_UA            &#x440;&#x43E;&#x441;&#x456;&#x439;&#x441;&#x44C;&#x43A;&#x430;, &#x423;&#x43A;&#x440;&#x430;&#x457;&#x43D;&#x430;
export LANG=es_ES            &#x456;&#x441;&#x43F;&#x430;&#x43D;&#x441;&#x44C;&#x43A;&#x430;, &#x406;&#x441;&#x43F;&#x430;&#x43D;&#x456;&#x44F;
export LANG=es_MX            &#x456;&#x441;&#x43F;&#x430;&#x43D;&#x441;&#x44C;&#x43A;&#x430;, &#x41C;&#x435;&#x43A;&#x441;&#x438;&#x43A;&#x430;
export LANG=en_US.iso88591   &#x430;&#x43D;&#x433;&#x43B;&#x456;&#x439;&#x441;&#x44C;&#x43A;&#x430;, &#x421;&#x428;&#x410;, &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; Latin-1
export LANG=en_GB.UTF-8      &#x430;&#x43D;&#x433;&#x43B;&#x456;&#x439;&#x441;&#x44C;&#x43A;&#x430;, &#x412;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x431;&#x440;&#x438;&#x442;&#x430;&#x43D;&#x456;&#x44F;, &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-8</code></pre>

<p>&#x41F;&#x43E;&#x432;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43C;&#x43E;&#x432; &#x442;&#x430; &#x43A;&#x43E;&#x434;&#x456;&#x432; &#x43A;&#x440;&#x430;&#x457;&#x43D; &#x43D;&#x430;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E; &#x443; &#x43F;&#x456;&#x434;&#x440;&#x443;&#x447;&#x43D;&#x438;&#x43A;&#x443; &#x437; gettext: <a href="https://www.gnu.org/software/gettext/manual/html_node/Usual-Language-Codes.html">https://www.gnu.org/software/gettext/manual/html_node/Usual-Language-Codes.html</a></p>

<p>&#x423; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445; Unix &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x449;&#x43E;&#x434;&#x43E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x44E; locale(1).</p>

</dd>
<dt id="LANGUAGE"><b>LANGUAGE</b></dt>
<dd>

<p>&#x417;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x430; LANGUAGE &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x440;&#x456;&#x43E;&#x440;&#x438;&#x442;&#x435;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43E;&#x432;. &#x417;&#x430;&#x43F;&#x438;&#x441;&#x438; &#x443; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x443; &#x441;&#x43B;&#x456;&#x434; &#x432;&#x456;&#x434;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x430;&#x43C;&#x438;. &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; dos2unix &#x43D;&#x430;&#x434;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x443; LANGUAGE &#x43D;&#x430;&#x434; LANG. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x435;&#x440;&#x448;&#x430; &#x433;&#x43E;&#x43B;&#x43B;&#x430;&#x43D;&#x434;&#x441;&#x44C;&#x43A;&#x430;, &#x434;&#x430;&#x43B;&#x456; &#x43D;&#x456;&#x43C;&#x435;&#x446;&#x44C;&#x43A;&#x430;: <code>LANGUAGE=nl:de</code>. &#x421;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x432;&#x430;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x443;&#x432;&#x456;&#x43C;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E;, &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x432;&#x448;&#x438; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; LANG (&#x430;&#x431;&#x43E; LC_ALL) &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x435; &#x432;&#x456;&#x434; &laquo;C&raquo;. &#x414;&#x430;&#x43B;&#x456; &#x432;&#x438; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x440;&#x456;&#x43E;&#x440;&#x438;&#x442;&#x435;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43E;&#x432; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; LANGUAGE. &#x414;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x443; &#x43F;&#x456;&#x434;&#x440;&#x443;&#x447;&#x43D;&#x438;&#x43A;&#x443; &#x437; gettext: <a href="https://www.gnu.org/software/gettext/manual/html_node/The-LANGUAGE-variable.html">https://www.gnu.org/software/gettext/manual/html_node/The-LANGUAGE-variable.html</a></p>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C;&#x438; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x431;&#x440;&#x430;&#x43D;&#x43E; &#x43C;&#x43E;&#x432;&#x443;, &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x44F;&#x43A;&#x43E;&#x44E; &#x43D;&#x435;&#x43C;&#x430;&#x454;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x456; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x43D;&#x433;&#x43B;&#x456;&#x439;&#x441;&#x44C;&#x43A;&#x43E;&#x44E; &#x43C;&#x43E;&#x432;&#x43E;&#x44E;.</p>

</dd>
<dt id="DOS2UNIX_LOCALEDIR"><b>DOS2UNIX_LOCALEDIR</b></dt>
<dd>

<p>&#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x443; LOCALEDIR, &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x443; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x437;&#x431;&#x438;&#x440;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x430; DOS2UNIX_LOCALEDIR. LOCALEDIR &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x448;&#x443;&#x43A;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432;. &#x422;&#x438;&#x43F;&#x43E;&#x432;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x443; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445; GNU &#x454; <code>/usr/local/share/locale</code>. &#x41F;&#x435;&#x440;&#x435;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; LOCALEDIR &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x438; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; <b>--version</b>.</p>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; (&#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x430; &#x43E;&#x431;&#x43E;&#x43B;&#x43E;&#x43D;&#x43A;&#x430; POSIX):</p>

<pre><code>export DOS2UNIX_LOCALEDIR=$HOME/share/locale</code></pre>

</dd>
</dl>

<h1 id="11">&#x41F;&#x41E;&#x412;&#x415;&#x420;&#x41D;&#x423;&#x422;&#x415; &#x417;&#x41D;&#x410;&#x427;&#x415;&#x41D;&#x41D;&#x42F;</h1>

<p>&#x42F;&#x43A;&#x449;&#x43E; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x434;&#x430;&#x441;&#x442;&#x44C;&#x441;&#x44F; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;, &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x43E; &#x43A;&#x43E;&#x434; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x42F;&#x43A;&#x449;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A;&#x430;&#x441;&#x44C; &#x456;&#x43D;&#x448;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x43E; &#x43A;&#x43E;&#x434; 1.</p>

<p>&#x423; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x443;&#x43B;&#x44C;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;.</p>

<h1 id="12">&#x421;&#x422;&#x410;&#x41D;&#x414;&#x410;&#x420;&#x422;&#x418;</h1>

<p><a href="https://en.wikipedia.org/wiki/Text_file">https://en.wikipedia.org/wiki/Text_file</a></p>

<p><a href="https://uk.wikipedia.org/wiki/Carriage_return">https://uk.wikipedia.org/wiki/Carriage_return</a></p>

<p><a href="https://uk.wikipedia.org/wiki/Newline">https://uk.wikipedia.org/wiki/Newline</a></p>

<p><a href="https://uk.wikipedia.org/wiki/Unicode">https://uk.wikipedia.org/wiki/Unicode</a></p>

<h1 id="13">&#x410;&#x412;&#x422;&#x41E;&#x420;&#x418;</h1>

<p>Benjamin Lin - &lt;blin@socs.uts.edu.au&gt;, Bernd Johannes Wuebben (&#x440;&#x435;&#x436;&#x438;&#x43C; mac2unix) - &lt;wuebben@kde.org&gt;, Christian Wurll (&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;) - &lt;wurll@ira.uka.de&gt;, Erwin Waterlander - &lt;waterlan@xs4all.nl&gt; (&#x441;&#x443;&#x43F;&#x440;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x43A;)</p>

<p>&#x421;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x454;&#x43A;&#x442;&#x443;: <a href="https://waterlan.home.xs4all.nl/dos2unix.html">https://waterlan.home.xs4all.nl/dos2unix.html</a></p>

<p>&#x421;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430; &#x43D;&#x430; SourceForge: <a href="https://sourceforge.net/projects/dos2unix/">https://sourceforge.net/projects/dos2unix/</a></p>

<h1 id="14">&#x422;&#x410;&#x41A;&#x41E;&#x416; &#x41F;&#x415;&#x420;&#x415;&#x413;&#x41B;&#x42F;&#x41D;&#x42C;&#x422;&#x415;</h1>

<p>file(1) find(1) iconv(1) locale(1) xargs(1)</p>


</body>

</html>


