<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>dos2unix 7.5.2 - &#x43f;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x447; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x430; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x443;&#x430;&#x43b;&#x43d;&#x438;&#x445; &#x434;&#x430;&#x442;&#x43e;&#x442;&#x435;&#x43a;&#x430; &#x438;&#x437; &#x414;&#x41e;&#x421;/&#x41c;&#x435;&#x43a;-&#x430; &#x443; &#x408;&#x443;&#x43d;&#x438;&#x43a;&#x441; &#x438; &#x43e;&#x431;&#x440;&#x430;&#x442;&#x43d;&#x43e;</title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:ASSI@walter.nonet" />
</head>

<body>



<ul id="index">
  <li><a href="#">&#x41D;&#x410;&#x417;&#x418;&#x412;</a></li>
  <li><a href="#1">&#x423;&#x412;&#x41E;&#x414;</a></li>
  <li><a href="#2">&#x41E;&#x41F;&#x418;&#x421;</a></li>
  <li><a href="#3">&#x41E;&#x41F;&#x426;&#x418;&#x408;&#x415;</a></li>
  <li><a href="#4">&#x41C;&#x415;&#x41A; &#x420;&#x415;&#x416;&#x418;&#x41C;</a></li>
  <li><a href="#5">&#x420;&#x415;&#x416;&#x418;&#x41C;&#x418; &#x41F;&#x420;&#x415;&#x422;&#x412;&#x410;&#x420;&#x410;&#x40A;&#x410;</a></li>
  <li><a href="#6">&#x423;&#x41D;&#x418;&#x41A;&#x41E;&#x414;</a>
    <ul>
      <li><a href="#7">&#x41A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430;</a></li>
      <li><a href="#8">&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435;</a></li>
      <li><a href="#9">&#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x430; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430;</a></li>
      <li><a href="#10">&#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43D;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443;</a></li>
      <li><a href="#11">&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x438; &#x423;&#x43D;&#x438;&#x43A;&#x43E;&#x434;&#x430;</a></li>
    </ul>
  </li>
  <li><a href="#GB18030">GB18030</a></li>
  <li><a href="#12">&#x41F;&#x420;&#x418;&#x41C;&#x415;&#x420;&#x418;</a></li>
  <li><a href="#13">&#x414;&#x423;&#x411;&#x418;&#x41D;&#x421;&#x41A;&#x41E; &#x41F;&#x420;&#x415;&#x422;&#x412;&#x410;&#x420;&#x410;&#x40A;&#x415;</a></li>
  <li><a href="#14">&#x408;&#x415;&#x417;&#x418;&#x427;&#x415;&#x40A;&#x415;</a></li>
  <li><a href="#17">&#x420;&#x415;&#x417;&#x423;&#x41B;&#x422;&#x41D;&#x410; &#x412;&#x420;&#x415;&#x414;&#x41D;&#x41E;&#x421;&#x422;</a></li>
  <li><a href="#18">&#x421;&#x422;&#x410;&#x41D;&#x414;&#x410;&#x420;&#x414;&#x418;</a></li>
  <li><a href="#19">&#x410;&#x423;&#x422;&#x41E;&#x420;&#x418;</a></li>
  <li><a href="#20">&#x412;&#x418;&#x414;&#x418;&#x422;&#x415; &#x422;&#x410;&#x41A;&#x41E;&#x402;&#x415;</a></li>
</ul>

<h1 id="">&#x41D;&#x410;&#x417;&#x418;&#x412;</h1>

<p>dos2unix &ndash; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x447; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x438;&#x437; &#x414;&#x41E;&#x421;/&#x41C;&#x435;&#x43A;-&#x430; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x438; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x43E;</p>

<h1 id="1">&#x423;&#x412;&#x41E;&#x414;</h1>

<pre><code>dos2unix [&#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435;] [&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; ...] [-n &#x423;&#x41B;&#x410;&#x417;&#x41D;&#x410;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; &#x418;&#x417;&#x41B;&#x410;&#x417;&#x41D;&#x410;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; ...]
unix2dos [&#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435;] [&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; ...] [-n &#x423;&#x41B;&#x410;&#x417;&#x41D;&#x410;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; &#x418;&#x417;&#x41B;&#x410;&#x417;&#x41D;&#x410;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; ...]</code></pre>

<h1 id="2">&#x41E;&#x41F;&#x418;&#x421;</h1>

<p>&ldquo;dos2unix&ldquo; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x443;&#x43A;&#x459;&#x443;&#x447;&#x443;&#x458;&#x435; &#x43F;&#x43E;&#x43C;&#x430;&#x433;&#x430;&#x43B;&#x430; &bdquo;<code>dos2unix</code>&ldquo; &#x438; &bdquo;<code>unix2dos</code>&ldquo; &#x437;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x43E;&#x431;&#x438;&#x447;&#x43D;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x443; &#x414;&#x41E;&#x421; &#x438;&#x43B;&#x438; &#x41C;&#x435;&#x43A; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x438; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x43E;.</p>

<p>&#x423; &#x414;&#x41E;&#x421;/&#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430;, &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x442;&#x43E; &#x438; &#x43A;&#x430;&#x43E; &#x43D;&#x43E;&#x432;&#x438; &#x440;&#x435;&#x434;, &#x458;&#x435; &#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x446;&#x438;&#x458;&#x430; &#x434;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x43A;&#x430;: &bdquo;Carriage Return&ldquo; (CR) &#x437;&#x430; &#x43A;&#x43E;&#x458;&#x438;&#x43C; &#x441;&#x43B;&#x435;&#x434;&#x438; &bdquo;Line Feed&ldquo; (LF). &#x423; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430; &#x458;&#x435; &#x458;&#x435;&#x434;&#x430;&#x43D; &#x437;&#x43D;&#x430;&#x43A;: &bdquo;Line Feed&ldquo; (LF). &#x423; &#x41C;&#x435;&#x43A; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430;, &#x43F;&#x440;&#x435; &#x41C;&#x435;&#x43A; &#x41E;&#x421; &#x418;&#x43A;&#x441;-&#x430;, &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430; &#x431;&#x435;&#x448;&#x435; &#x458;&#x435;&#x434;&#x430;&#x43D; &#x437;&#x43D;&#x430;&#x43A; &bdquo;Carriage Return&ldquo; (CR). &#x414;&#x430;&#x43D;&#x430;&#x441; &#x41C;&#x435;&#x43A; &#x41E;&#x421; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x441;&#x442;&#x438;&#x43B;&#x443; (LF).</p>

<p>&#x41F;&#x43E;&#x440;&#x435;&#x434; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &bdquo;dos2unix&ldquo; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;. &#x41D;&#x435;&#x43A;&#x43E;&#x43B;&#x438;&#x43A;&#x43E; &#x414;&#x41E;&#x421; &#x43A;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430; &#x441;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; Latin-1. &#x410; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; (&#x423;&#x422;&#x424;-16) &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; (&#x423;&#x422;&#x424;-8) &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;.</p>

<p>&#x411;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x430;&#x443;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x441;&#x43A;&#x438; &#x43F;&#x440;&#x435;&#x441;&#x43A;&#x430;&#x447;&#x443;, &#x43E;&#x441;&#x438;&#x43C; &#x430;&#x43A;&#x43E; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x43D;&#x438;&#x458;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x43E;&#x440;&#x430;&#x43D;&#x43E;.</p>

<p>&#x41D;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;, &#x43A;&#x430;&#x43E; &#x448;&#x442;&#x43E; &#x441;&#x443; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x458;&#x443;&#x43C;&#x443; &#x438; &#x41F;&#x423;&#x41F;&#x418;, &#x441;&#x435; &#x430;&#x443;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x441;&#x43A;&#x438; &#x43F;&#x440;&#x435;&#x441;&#x43A;&#x430;&#x447;&#x443;.</p>

<p>&#x421;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438;&#x447;&#x43A;&#x435; &#x432;&#x435;&#x437;&#x435; &#x438; &#x45A;&#x438;&#x445;&#x43E;&#x432;&#x438; &#x446;&#x438;&#x459;&#x435;&#x432;&#x438; &#x441;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x43D;&#x435; &#x434;&#x438;&#x440;&#x430;&#x458;&#x443;. &#x421;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438;&#x447;&#x43A;&#x435; &#x432;&#x435;&#x437;&#x435; &#x441;&#x435; &#x43F;&#x43E; &#x436;&#x435;&#x459;&#x438; &#x43C;&#x43E;&#x433;&#x443; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x438;, &#x438;&#x43B;&#x438; &#x441;&#x435; &#x438;&#x437;&#x43B;&#x430;&#x437; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x43C;&#x435;&#x442;&#x443; &#x441;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438;&#x447;&#x43A;&#x435; &#x432;&#x435;&#x437;&#x435;. &#x41F;&#x438;&#x441;&#x430;&#x45A;&#x435; &#x43D;&#x430; &#x43C;&#x435;&#x442;&#x443; &#x441;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438;&#x447;&#x43A;&#x435; &#x432;&#x435;&#x437;&#x435; &#x43D;&#x438;&#x458;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x436;&#x430;&#x43D;&#x43E; &#x43D;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443;.</p>

<p>&bdquo;dos2unix&ldquo; &#x458;&#x435; &#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x459;&#x435;&#x43D; &#x43F;&#x43E; &#x443;&#x437;&#x43E;&#x440;&#x443; &#x43D;&#x430; &bdquo;dos2unix&ldquo; &#x43F;&#x43E;&#x434; &#x421;&#x430;&#x43D;&#x41E;&#x421;/&#x421;&#x43E;&#x43B;&#x430;&#x440;&#x438;&#x441;&#x43E;&#x43C;. &#x41F;&#x43E;&#x441;&#x442;&#x43E;&#x458;&#x438; &#x458;&#x435;&#x434;&#x43D;&#x430; &#x432;&#x430;&#x436;&#x43D;&#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x43A;&#x430; &#x441;&#x430; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x438;&#x43C; &#x421;&#x430;&#x43D;&#x41E;&#x421;/&#x421;&#x43E;&#x43B;&#x430;&#x440;&#x438;&#x441; &#x438;&#x437;&#x434;&#x430;&#x45A;&#x435;&#x43C;. &#x41E;&#x432;&#x43E; &#x438;&#x437;&#x434;&#x430;&#x45A;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x432;&#x440;&#x448;&#x438; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x443; &#x43C;&#x435;&#x441;&#x442;&#x443; (&#x441;&#x442;&#x430;&#x440;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;), &#x434;&#x43E;&#x43A; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x43E; &#x421;&#x430;&#x43D;&#x41E;&#x421;/&#x421;&#x43E;&#x43B;&#x430;&#x440;&#x438;&#x441; &#x438;&#x437;&#x434;&#x430;&#x45A;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430; &#x441;&#x430;&#x43C;&#x43E; &#x443;&#x43F;&#x430;&#x440;&#x435;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; (&#x43D;&#x43E;&#x432;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;). &#x422;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43F;&#x43E;&#x433;&#x43B;&#x435;&#x434;&#x430;&#x458;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &bdquo;<code>-o</code>&ldquo; &#x438; &bdquo;<code>-n</code>&ldquo;. &#x414;&#x440;&#x443;&#x433;&#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x43A;&#x430; &#x458;&#x435; &#x443; &#x442;&#x43E;&#x43C;&#x435; &#x448;&#x442;&#x43E; &#x438;&#x437;&#x434;&#x430;&#x45A;&#x435; &#x421;&#x430;&#x43D;&#x41E;&#x421;/&#x421;&#x43E;&#x43B;&#x430;&#x440;&#x438;&#x441;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &bdquo;<i>iso</i>&ldquo; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430; &#x434;&#x43E;&#x43A; &#x43E;&#x432;&#x43E; &#x438;&#x437;&#x434;&#x430;&#x45A;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &bdquo;<i>ascii</i>&ldquo; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430;.</p>

<h1 id="3">&#x41E;&#x41F;&#x426;&#x418;&#x408;&#x415;</h1>

<dl>

<dt id="pod"><b>--</b></dt>
<dd>

<p>&#x421;&#x43C;&#x430;&#x442;&#x440;&#x430; &#x441;&#x432;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x435;&#x45B;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &#x43A;&#x430;&#x43E; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;. &#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x432;&#x443; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &#x430;&#x43A;&#x43E; &#x436;&#x435;&#x43B;&#x438;&#x442;&#x435; &#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x447;&#x438;&#x458;&#x438; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x43F;&#x43E;&#x447;&#x438;&#x45A;&#x443; &#x446;&#x440;&#x442;&#x438;&#x446;&#x43E;&#x43C;. &#x41D;&#x430; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x43F;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x43E;&#x43C; &bdquo;-foo&ldquo;, &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43E;&#x432;&#x443; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x443;:</p>

<pre><code>dos2unix -- -foo</code></pre>

<p>&#x418;&#x43B;&#x438; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43D;&#x43E;&#x432;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;:</p>

<pre><code>dos2unix -n -- -foo &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

</dd>
<dt id="allow-chown"><b>--allow-chown</b></dt>
<dd>

<p>&#x421;&#x432;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x43C;&#x435;&#x45A;&#x430;&#x458;&#x443; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x441;&#x442;&#x430;&#x440;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x43E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430;, &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x441;&#x435; &#x43D;&#x435;&#x45B;&#x435; &#x43F;&#x440;&#x435;&#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438; &#x43A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x438;/&#x438;&#x43B;&#x438; &#x433;&#x440;&#x443;&#x43F;&#x435; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x430;&#x447;&#x443;&#x432;&#x430;&#x442;&#x438; &#x443; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x45B;&#x435; &#x441;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x438; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x45B;&#x435; &#x434;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x438;&#x441;&#x442;&#x43E; &#x43D;&#x43E;&#x432;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x43E; &#x43A;&#x430;&#x43E; &#x434;&#x430; &#x458;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43D;&#x43E;&#x432;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x422;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43F;&#x43E;&#x433;&#x43B;&#x435;&#x434;&#x430;&#x458;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &bdquo;<code>-o</code>&ldquo; &#x438; &bdquo;<code>-n</code>&ldquo;. &#x41E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &#x458;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E; &#x430;&#x43A;&#x43E; &bdquo;dos2unix&ldquo; &#x438;&#x43C;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x443; &#x437;&#x430; &#x43E;&#x447;&#x443;&#x432;&#x430;&#x45A;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x438; &#x433;&#x440;&#x443;&#x43F;&#x435; &#x43D;&#x430;&#x434; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430;.</p>

</dd>
<dt id="ascii"><b>-ascii</b></dt>
<dd>

<p>Default conversion mode. See also section CONVERSION MODES.</p>

</dd>
<dt id="iso"><b>-iso</b></dt>
<dd>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x452;&#x443; &#x414;&#x41E;&#x421; &#x438; &#x418;&#x421;&#x41E;-8859-1 &#x441;&#x43A;&#x443;&#x43F;&#x430; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x430;. &#x412;&#x438;&#x434;&#x438;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43E;&#x434;&#x435;&#x459;&#x430;&#x43A; &#x420;&#x415;&#x416;&#x418;&#x41C;&#x418; &#x41F;&#x420;&#x415;&#x422;&#x412;&#x410;&#x420;&#x410;&#x40A;&#x410;.</p>

</dd>
<dt id="pod-1252"><b>-1252</b></dt>
<dd>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; 1252 (&#x437;&#x430;&#x43F;&#x430;&#x434;&#x43D;&#x43E;&#x435;&#x432;&#x440;&#x43E;&#x43F;&#x441;&#x43A;&#x438;).</p>

</dd>
<dt id="pod-437"><b>-437</b></dt>
<dd>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x414;&#x41E;&#x421; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; 437 (&#x421;&#x458;&#x435;&#x434;&#x438;&#x45A;&#x435;&#x43D;&#x435; &#x414;&#x440;&#x436;&#x430;&#x432;&#x435;). &#x41E;&#x432;&#x43E; &#x458;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430; &#x43A;&#x43E;&#x434;&#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x448;&#x45B;&#x435;&#x43D;&#x430; &#x437;&#x430; &#x418;&#x421;&#x41E; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435;.</p>

</dd>
<dt id="pod-850"><b>-850</b></dt>
<dd>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x414;&#x41E;&#x421; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; 850 (&#x437;&#x430;&#x43F;&#x430;&#x434;&#x43D;&#x43E;&#x435;&#x432;&#x440;&#x43E;&#x43F;&#x441;&#x43A;&#x438;).</p>

</dd>
<dt id="pod-860"><b>-860</b></dt>
<dd>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x414;&#x41E;&#x421; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; 860 (&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x433;&#x430;&#x43B;&#x441;&#x43A;&#x438;).</p>

</dd>
<dt id="pod-863"><b>-863</b></dt>
<dd>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x414;&#x41E;&#x421; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; 863 (&#x444;&#x440;&#x430;&#x43D;&#x446;&#x443;&#x441;&#x43A;&#x438; &#x43A;&#x430;&#x43D;&#x430;&#x434;&#x441;&#x43A;&#x438;).</p>

</dd>
<dt id="pod-865"><b>-865</b></dt>
<dd>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x414;&#x41E;&#x421; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; 865 (&#x43D;&#x43E;&#x440;&#x434;&#x438;&#x458;&#x441;&#x43A;&#x438;).</p>

</dd>
<dt id="pod-7"><b>-7</b></dt>
<dd>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; 8 &#x431;&#x438;&#x442;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x435; &#x443; 7 &#x431;&#x438;&#x442;&#x43D;&#x435; &#x440;&#x430;&#x437;&#x43C;&#x430;&#x43A;&#x435;.</p>

</dd>
<dt id="b---keep-bom"><b>-b, --keep-bom</b></dt>
<dd>

<p>&#x417;&#x430;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430; &#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x430; (BOM). &#x41A;&#x430;&#x434;&#x430; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x438;&#x43C;&#x430; &#x41E;&#x420;&#x411;, &#x43F;&#x438;&#x448;&#x435; &#x41E;&#x420;&#x411; &#x443; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443;. &#x41E;&#x432;&#x43E; &#x458;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x430;&#x448;&#x430;&#x45A;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430; &#x443; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430;. &#x412;&#x438;&#x434;&#x438;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-r</code>&ldquo;.</p>

</dd>
<dt id="c---convmode-_"><b>-c, --convmode &#x420;&#x415;&#x416;&#x418;&#x41C;_&#x41F;&#x420;&#x415;&#x422;&#x412;&#x410;&#x420;&#x410;&#x40A;&#x410;</b></dt>
<dd>

<p>&#x41F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x459;&#x430; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430;. &#x413;&#x434;&#x435; &#x458;&#x435; &#x420;&#x415;&#x416;&#x418;&#x41C;_&#x41F;&#x420;&#x415;&#x422;&#x412;&#x410;&#x420;&#x410;&#x40A;&#x410; &#x458;&#x435;&#x434;&#x430;&#x43D; &#x43E;&#x434;: <i>ascii</i>, <i>7bit</i>, <i>iso</i>, <i>mac</i> &#x433;&#x434;&#x435; &#x458;&#x435; &bdquo;ascii&ldquo; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x438;.</p>

</dd>
<dt id="D---display-enc"><b>-D, --display-enc &#x41A;&#x41E;&#x414;&#x418;&#x420;&#x410;&#x40A;&#x415;</b></dt>
<dd>

<p>&#x41F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x459;&#x430; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;&#x433; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430;. &#x413;&#x434;&#x435; &#x458;&#x435; &#x41A;&#x41E;&#x414;&#x418;&#x420;&#x410;&#x40A;&#x415; &#x458;&#x435;&#x434;&#x43D;&#x43E; &#x43E;&#x434;: <i>ansi</i>, <i>unicode</i>, <i>unicodebom</i>, <i>utf8</i>, <i>utf8bom</i> &#x433;&#x434;&#x435; &#x458;&#x435; &bdquo;ansi&ldquo; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;.</p>

<p>&#x41E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &#x458;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E; &#x443; &bdquo;dos2unix&ldquo; &#x437;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x441;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x43E;&#x43C; &#x437;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x41E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &#x43D;&#x435;&#x43C;&#x430; &#x443;&#x442;&#x438;&#x446;&#x430;&#x458;&#x430; &#x43D;&#x430; &#x441;&#x442;&#x432;&#x430;&#x440;&#x43D;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x45A;&#x435; &#x438; &#x43F;&#x438;&#x441;&#x430;&#x45A;&#x435; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;, &#x432;&#x435;&#x45B; &#x441;&#x430;&#x43C;&#x43E; &#x43D;&#x430; &#x43D;&#x430;&#x447;&#x438;&#x43D; &#x43D;&#x430; &#x43A;&#x43E;&#x458;&#x438; &#x441;&#x435; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x443;.</p>

<p>&#x41F;&#x43E;&#x441;&#x442;&#x43E;&#x458;&#x438; &#x43D;&#x435;&#x43A;&#x43E;&#x43B;&#x438;&#x43A;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; &#x437;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x438;&#x432;&#x430;&#x45A;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; &#x443; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x438; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x443; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430;. &#x421;&#x432;&#x438; &#x43E;&#x43D;&#x438; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x441;&#x432;&#x43E;&#x458;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x438; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43A;&#x435;.</p>

<dl>

<dt id="ansi"><b>ansi</b></dt>
<dd>

<p>&#x41F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &bdquo;dos2unix&ldquo;-&#x430; &#x458;&#x435; &#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x410;&#x41D;&#x421;&#x418; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D; &#x442;&#x435;&#x43A;&#x441;&#x442;. &#x41F;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x458;&#x435; &#x443; &#x442;&#x43E;&#x43C;&#x435; &#x448;&#x442;&#x43E; &#x458;&#x435; &#x43F;&#x43E;&#x432;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x430;&#x43D;. &#x420;&#x430;&#x434;&#x438; &#x441;&#x430; &#x440;&#x430;&#x441;&#x442;&#x435;&#x440;&#x441;&#x43A;&#x438;&#x43C; &#x438; &bdquo;TrueType&ldquo; &#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x430;. &#x423; &#x43D;&#x435;&#x43A;&#x438;&#x43C; &#x440;&#x435;&#x433;&#x438;&#x43E;&#x43D;&#x438;&#x43C;&#x430; &#x45B;&#x435;&#x442;&#x435; &#x43C;&#x43E;&#x436;&#x434;&#x430; &#x43C;&#x43E;&#x440;&#x430;&#x442;&#x438; &#x434;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x435; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x443; &#x414;&#x41E;&#x421; &#x41E;&#x415;&#x41C; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x443; &#x410;&#x41D;&#x421;&#x418; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x43F;&#x43E;&#x43C;&#x43E;&#x45B;&#x443; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x435; &bdquo;<code>chcp</code>&ldquo;, &#x458;&#x435;&#x440; &bdquo;dos2unix&ldquo; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;.</p>

<p>&#x41D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x430;&#x43A; &#x430;&#x43D;&#x441;&#x438;-&#x458;&#x430; &#x458;&#x435; &#x448;&#x442;&#x43E; &#x441;&#x435; &#x43C;&#x435;&#x452;&#x443;&#x43D;&#x430;&#x440;&#x43E;&#x434;&#x43D;&#x438; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x441;&#x430; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x430; &#x43A;&#x43E;&#x458;&#x438; &#x43D;&#x438;&#x441;&#x443; &#x443;&#x43D;&#x443;&#x442;&#x430;&#x440; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x441;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x435; &#x43A;&#x43E;&#x434;&#x43D;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x443; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43D;&#x43E;. &#x423;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x442;&#x43E;&#x433;&#x430; &#x432;&#x438;&#x434;&#x435;&#x45B;&#x435;&#x442;&#x435; &#x437;&#x43D;&#x430;&#x43A; &#x43F;&#x438;&#x442;&#x430;&#x45A;&#x430;, &#x438;&#x43B;&#x438; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x430;&#x43D; &#x441;&#x438;&#x43C;&#x431;&#x43E;&#x43B;. &#x41A;&#x430;&#x434;&#x430; &#x43D;&#x435; &#x440;&#x430;&#x434;&#x438;&#x442;&#x435; &#x441;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x43C; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438;&#x43C;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;, &#x43E;&#x432;&#x430;&#x458; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x458;&#x435; &#x443; &#x440;&#x435;&#x434;&#x443;.</p>

</dd>
<dt id="unicode-unicodebom"><b>unicode, unicodebom</b></dt>
<dd>

<p>&#x41F;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x458;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430; (&#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43D;&#x430;&#x437;&#x438;&#x432; &#x437;&#x430; &#x423;&#x422;&#x424;-16) &#x458;&#x435; &#x443; &#x442;&#x43E;&#x43C;&#x435; &#x448;&#x442;&#x43E; &#x441;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x43E;&#x431;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435;. &#x41D;&#x435;&#x43C;&#x430; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x435; &#x437;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x43E;&#x43C; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43A;&#x43E;&#x434;&#x43D;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;. &#x41C;&#x43E;&#x436;&#x434;&#x430; &#x45B;&#x435;&#x442;&#x435; &#x43C;&#x43E;&#x440;&#x430;&#x442;&#x438; &#x434;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x430; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x435; &#x43D;&#x430; &bdquo;TrueType&ldquo; &#x434;&#x430; &#x431;&#x438; &#x441;&#x435; &#x43C;&#x435;&#x452;&#x443;&#x43D;&#x430;&#x440;&#x43E;&#x434;&#x43D;&#x438; &#x437;&#x43D;&#x430;&#x446;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x438;&#x432;&#x430;&#x43B;&#x438;. &#x41A;&#x430;&#x434;&#x430; &#x437;&#x43D;&#x430;&#x43A; &#x43D;&#x438;&#x458;&#x435; &#x443;&#x43A;&#x459;&#x443;&#x447;&#x435;&#x43D; &#x443; &bdquo;TrueType&ldquo; &#x441;&#x43B;&#x43E;&#x432;&#x430; &#x43E;&#x431;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x43C;&#x430;&#x43B;&#x438; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;, &#x43F;&#x43E;&#x43D;&#x435;&#x43A;&#x430;&#x434; &#x441;&#x430; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; &#x43F;&#x438;&#x442;&#x430;&#x45A;&#x430; &#x443; &#x45A;&#x435;&#x43C;&#x443;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &bdquo;ConEmu&ldquo; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x443; &#x441;&#x430;&#x432; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x441;&#x435; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435;, &#x458;&#x435;&#x440; &bdquo;ConEmu&ldquo; &#x430;&#x443;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x441;&#x43A;&#x438; &#x431;&#x438;&#x440;&#x430; &#x434;&#x43E;&#x431;&#x440;&#x430; &#x441;&#x43B;&#x43E;&#x432;&#x430;.</p>

<p>&#x41D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x430;&#x43A; &#x458;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434;-&#x430; &#x458;&#x435; &#x448;&#x442;&#x43E; &#x43D;&#x438;&#x458;&#x435; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x430;&#x43D; &#x441;&#x430; &#x410;&#x421;&#x41A;&#x420;&#x418;-&#x458;&#x435;&#x43C;. &#x418;&#x437;&#x43B;&#x430;&#x437;&#x43E;&#x43C; &#x43D;&#x438;&#x458;&#x435; &#x43B;&#x430;&#x43A;&#x43E; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x430;&#x434;&#x430; &#x433;&#x430; &#x43F;&#x440;&#x435;&#x443;&#x441;&#x43C;&#x435;&#x440;&#x438;&#x442;&#x435; &#x43D;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &bdquo;<code>unicodebom</code>&ldquo; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443; &#x45B;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x41E;&#x420;&#x411; (&#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x430; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x432;&#x431;&#x430;&#x458;&#x442;&#x43E;&#x430;). &#x41E;&#x420;&#x411; &#x458;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x430;&#x43D; &#x437;&#x430; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x443;&#x441;&#x43C;&#x435;&#x440;&#x430;&#x432;&#x430;&#x45A;&#x435; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x435;&#x441;&#x43F;&#x430;&#x458;&#x430;&#x45A;&#x435; &#x443; &bdquo;PowerShell&ldquo;-&#x443;.</p>

</dd>
<dt id="utf8-utf8bom"><b>utf8, utf8bom</b></dt>
<dd>

<p>&#x41F;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x443;&#x442;&#x444;8 &#x458;&#x435; &#x443; &#x442;&#x43E;&#x43C;&#x435; &#x448;&#x442;&#x43E; &#x458;&#x435; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x430;&#x43D; &#x441;&#x430; &#x410;&#x421;&#x41A;&#x420;&#x418;-&#x458;&#x435;&#x43C;. &#x421;&#x43B;&#x43E;&#x432;&#x430; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x435; &#x442;&#x440;&#x435;&#x431;&#x430; &#x434;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x43D;&#x430; &bdquo;TrueType&ldquo; &#x441;&#x43B;&#x43E;&#x432;&#x430;. &#x421;&#x430; &bdquo;TrueType&ldquo; &#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x441;&#x435; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x441;&#x43B;&#x438;&#x447;&#x43D;&#x43E; &#x43A;&#x430;&#x43E; &#x438; &#x441;&#x430; &bdquo;<code>unicode</code>&ldquo; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435;&#x43C;.</p>

<p>&#x41D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x430;&#x43A; &#x458;&#x435; &#x448;&#x442;&#x43E; &#x441;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43A;&#x43E;&#x440;&#x438;&#x448;&#x45B;&#x435;&#x45A;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x440;&#x430;&#x441;&#x442;&#x435;&#x440;&#x441;&#x43A;&#x438;&#x445; &#x441;&#x43B;&#x43E;&#x432;&#x430; &#x441;&#x432;&#x438; &#x43D;&#x435;-&#x410;&#x421;&#x41A;&#x420;&#x418; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438; &#x441;&#x435; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x443;. &#x41D;&#x435; &#x441;&#x430;&#x43C;&#x43E; &#x434;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;, &#x432;&#x435;&#x45B; &#x438; &#x43F;&#x440;&#x435;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x435; &#x43F;&#x43E;&#x440;&#x443;&#x43A;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x458;&#x443; &#x43D;&#x435;&#x447;&#x438;&#x442;&#x459;&#x438;&#x432;&#x435;. &#x423; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443; &#x43F;&#x43E;&#x434;&#x435;&#x448;&#x435;&#x43D;&#x43E;&#x43C; &#x437;&#x430; &#x440;&#x435;&#x433;&#x438;&#x458;&#x443; &#x418;&#x441;&#x442;&#x43E;&#x447;&#x43D;&#x435; &#x410;&#x437;&#x438;&#x458;&#x435;, &#x43C;&#x43E;&#x436;&#x434;&#x430; &#x45B;&#x435;&#x442;&#x435; &#x432;&#x438;&#x434;&#x435;&#x442;&#x438; &#x43F;&#x443;&#x43D;&#x43E; &#x442;&#x440;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x45A;&#x430; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x438;&#x432;&#x430;&#x45A;&#x430; &#x43F;&#x43E;&#x440;&#x443;&#x43A;&#x430;.</p>

<p>&#x423; &bdquo;ConEmu&ldquo; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x438; &#x443;&#x442;&#x444;8 &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430; &#x440;&#x430;&#x434;&#x438; &#x43B;&#x435;&#x43F;&#x43E;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &bdquo;<code>utf8bom</code>&ldquo; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x423;&#x422;&#x424;-8 &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443; &#x45B;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x41E;&#x420;&#x411; (&#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x430; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x432;&#x431;&#x430;&#x458;&#x442;&#x43E;&#x430;). &#x41E;&#x420;&#x411; &#x458;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43D;&#x430; &#x437;&#x430; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x443;&#x441;&#x43C;&#x435;&#x440;&#x430;&#x432;&#x430;&#x45A;&#x435; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x435;&#x441;&#x43F;&#x430;&#x458;&#x430;&#x45A;&#x435; &#x443; &bdquo;PowerShell&ldquo;-&#x443;.</p>

</dd>
</dl>

<p>&#x41F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x459;&#x438;&#x432;&#x43E;&#x43C; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x45A;&#x430; &bdquo;DOS2UNIX_DISPLAY_ENC&ldquo; &#x442;&#x430;&#x43A;&#x43E; &#x448;&#x442;&#x43E; &#x45B;&#x435;&#x442;&#x435; &#x458;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x43D;&#x430; &bdquo;<code>unicode</code>&ldquo;, &bdquo;<code>unicodebom</code>&ldquo;, &bdquo;<code>utf8</code>&ldquo;, &#x438;&#x43B;&#x438; &bdquo;<code>utf8bom</code>&ldquo;.</p>

</dd>
<dt id="e---add-eol"><b>-e, --add-eol</b></dt>
<dd>

<p>&#x414;&#x43E;&#x434;&#x430;&#x458;&#x435; &#x43F;&#x440;&#x435;&#x43A;&#x438;&#x434; &#x440;&#x435;&#x434;&#x430; &#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x45A;&#x438; &#x440;&#x435;&#x434; &#x430;&#x43A;&#x43E; &#x433;&#x430; &#x43D;&#x435;&#x43C;&#x430;. &#x41E;&#x432;&#x43E; &#x440;&#x430;&#x434;&#x438; &#x437;&#x430; &#x441;&#x432;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430;.</p>

<p>&#x414;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x446;&#x438; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E;&#x458; &#x438;&#x437; &#x414;&#x41E;&#x421; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x458;&#x435; &#x43F;&#x440;&#x435;&#x43A;&#x438;&#x434; &#x440;&#x435;&#x434;&#x430; &#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x45A;&#x435;&#x43C; &#x440;&#x435;&#x434;&#x443;. &#x41F;&#x43E;&#x441;&#x442;&#x43E;&#x458;&#x435; &#x443;&#x440;&#x435;&#x452;&#x438;&#x432;&#x430;&#x447;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; &#x43A;&#x43E;&#x458;&#x438; &#x43F;&#x438;&#x448;&#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x431;&#x435;&#x437; &#x43F;&#x440;&#x435;&#x43A;&#x438;&#x434;&#x430; &#x440;&#x435;&#x434;&#x430; &#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x45A;&#x435;&#x43C; &#x440;&#x435;&#x434;&#x443;. &#x41D;&#x435;&#x43A;&#x438; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x441;&#x430; &#x43E;&#x431;&#x440;&#x430;&#x434;&#x43E;&#x43C; &#x442;&#x438;&#x445; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;, &#x458;&#x435;&#x440; POSIX &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x434; &#x43E;&#x434;&#x440;&#x435;&#x452;&#x443;&#x458;&#x435; &#x434;&#x430; &#x441;&#x432;&#x430;&#x43A;&#x438; &#x440;&#x435;&#x434; &#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x43E;&#x458; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x446;&#x438; &#x43C;&#x43E;&#x440;&#x430; &#x434;&#x430; &#x441;&#x435; &#x437;&#x430;&#x432;&#x440;&#x448;&#x430;&#x432;&#x430; &#x43A;&#x440;&#x430;&#x458;&#x45A;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x433; &#x440;&#x435;&#x434;&#x430;. &#x408;&#x435;&#x440; &#x43D;&#x430;&#x434;&#x43E;&#x432;&#x435;&#x437;&#x430;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43D;&#x435;&#x45B;&#x435; &#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x447;&#x435;&#x43A;&#x438;&#x432;&#x430;&#x43D;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x442;&#x430;&#x442;.</p>

</dd>
<dt id="f---force"><b>-f, --force</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x441;&#x438;&#x459;&#x430;&#x432;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;.</p>

</dd>
<dt id="gb---gb18030"><b>-gb, --gb18030</b></dt>
<dd>

<p>&#x423; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443; &#x443; &#x423;&#x422;&#x424;-8, &#x431;&#x435;&#x437; &#x43E;&#x431;&#x437;&#x438;&#x440;&#x430; &#x43D;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x435; &#x458;&#x435;&#x437;&#x438;&#x43A;&#x430;. &#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x432;&#x443; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &#x437;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x443; &bdquo;GB18030&ldquo;. &#x41E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &#x458;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E; &#x443; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443;. &#x422;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43F;&#x43E;&#x433;&#x43B;&#x435;&#x434;&#x430;&#x458;&#x442;&#x435; &#x43E;&#x434;&#x435;&#x459;&#x430;&#x43A; &bdquo;GB18030&ldquo;.</p>

</dd>
<dt id="h---help"><b>-h, --help</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x43F;&#x43E;&#x43C;&#x43E;&#x45B; &#x438; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x438;.</p>

</dd>
<dt id="i---info"><b>-i[&#x417;&#x410;&#x421;&#x422;&#x410;&#x412;&#x418;&#x426;&#x415;], --info[=&#x417;&#x410;&#x421;&#x422;&#x410;&#x412;&#x418;&#x426;&#x415;] &#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; ...</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x435; &#x43E; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x446;&#x438;. &#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x441;&#x435; &#x43D;&#x435; &#x440;&#x430;&#x434;&#x438;.</p>

<p>&#x421;&#x43B;&#x435;&#x434;&#x435;&#x45B;&#x435; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x458;&#x435; &#x441;&#x435; &#x438;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x443;, &#x43E;&#x432;&#x438;&#x43C; &#x440;&#x435;&#x434;&#x43E;&#x43C;: &#x431;&#x440;&#x43E;&#x458; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x43E;&#x43C;&#x430; &#x440;&#x435;&#x434;&#x430;, &#x431;&#x440;&#x43E;&#x458; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x43E;&#x43C;&#x430; &#x440;&#x435;&#x434;&#x430;, &#x431;&#x440;&#x43E;&#x458; &#x41C;&#x435;&#x43A; &#x43F;&#x440;&#x435;&#x43B;&#x43E;&#x43C;&#x430; &#x440;&#x435;&#x434;&#x430;, &#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x430; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430;, &#x442;&#x435;&#x43A;&#x441;&#x442; &#x438;&#x43B;&#x438; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x430;, &#x43D;&#x430;&#x437;&#x438;&#x432; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;.</p>

<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x430;:</p>

<pre><code> 6       0       0  no_bom    &#x442;&#x435;&#x43A;&#x441;&#x442;    dos.txt
 0       6       0  no_bom    &#x442;&#x435;&#x43A;&#x441;&#x442;    unix.txt
 0       0       6  no_bom    &#x442;&#x435;&#x43A;&#x441;&#x442;    mac.txt
 6       6       6  no_bom    &#x442;&#x435;&#x43A;&#x441;&#x442;    mixed.txt
50       0       0  UTF-16LE  &#x442;&#x435;&#x43A;&#x441;&#x442;    utf16le.txt
 0      50       0  no_bom    &#x442;&#x435;&#x43A;&#x441;&#x442;    utf8unix.txt
50       0       0  UTF-8     &#x442;&#x435;&#x43A;&#x441;&#x442;    utf8dos.txt
 2     418     219  no_bom    &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x430;  dos2unix.exe</code></pre>

<p>&#x417;&#x43D;&#x430;&#x458;&#x442;&#x435; &#x434;&#x430; &#x43F;&#x43E;&#x43D;&#x435;&#x43A;&#x430;&#x434; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x43E;&#x43C; &#x431;&#x438;&#x442;&#x438; &#x443;&#x437;&#x435;&#x442;&#x430; &#x437;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443;. &#x412;&#x438;&#x434;&#x438;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-s</code>&ldquo;.</p>

<p>If in addition option <code>-e</code> or <code>--add-eol</code> is used also the type of the line break of the last line is printed, or <code>noeol</code> if there is none.</p>

<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x430;:</p>

<pre><code>6       0       0  no_bom    text   dos     dos.txt
0       6       0  no_bom    text   unix    unix.txt
0       0       6  no_bom    text   mac     mac.txt
1       0       0  no_bom    text   noeol   noeol_dos.txt</code></pre>

<p>&#x418;&#x437;&#x431;&#x43E;&#x440;&#x43D;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43D;&#x435; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x446;&#x435; &#x441;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x434;&#x430; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435; &#x438;&#x437;&#x43B;&#x430;&#x437;. &#x41C;&#x43E;&#x433;&#x443; &#x441;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x458;&#x435;&#x434;&#x43D;&#x430; &#x438;&#x43B;&#x438; &#x432;&#x438;&#x448;&#x435; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x446;&#x430;.</p>

<dl>

<dt id="pod0"><b>0</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x440;&#x435;&#x434;&#x43E;&#x432;&#x435; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x458;&#x430; &#x43E; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x446;&#x438; &#x437;&#x430; &#x43A;&#x43E;&#x458;&#x438;&#x43C;&#x430; &#x441;&#x43B;&#x435;&#x434;&#x438; &#x43D;&#x443;&#x43B;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x43A; &#x443;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x43A;&#x430; &#x43D;&#x43E;&#x432;&#x43E;&#x433; &#x440;&#x435;&#x434;&#x430;. &#x41E;&#x432;&#x43E; &#x43E;&#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x430;&#x432;&#x430; &#x442;&#x430;&#x447;&#x43D;&#x43E; &#x442;&#x443;&#x43C;&#x430;&#x447;&#x435;&#x45A;&#x435; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x441; &#x440;&#x430;&#x437;&#x43C;&#x430;&#x446;&#x438;&#x43C;&#x430; &#x438;&#x43B;&#x438; &#x43D;&#x430;&#x432;&#x43E;&#x434;&#x43D;&#x438;&#x446;&#x438;&#x43C;&#x430; &#x43A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x446;&#x430; &bdquo;c&ldquo;. &#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x432;&#x443; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x446;&#x443; &#x443; &#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x446;&#x438;&#x458;&#x438; &#x441;&#x430; &bdquo;xargs(1)&ldquo; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x43E;&#x43C; &bdquo;<code>-0</code>&ldquo; &#x438;&#x43B;&#x438; &bdquo;<code>--null</code>&ldquo;.</p>

</dd>
<dt id="d"><b>d</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x431;&#x440;&#x43E;&#x458; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;.</p>

</dd>
<dt id="u"><b>u</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x431;&#x440;&#x43E;&#x458; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;.</p>

</dd>
<dt id="m"><b>m</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x431;&#x440;&#x43E;&#x458; &#x41C;&#x435;&#x43A; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;.</p>

</dd>
<dt id="b"><b>b</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430;.</p>

</dd>
<dt id="t"><b>t</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x434;&#x430; &#x43B;&#x438; &#x458;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x430; &#x438;&#x43B;&#x438; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x430;.</p>

</dd>
<dt id="e"><b>e</b></dt>
<dd>

<p>Print the type of the line break of the last line, or <code>noeol</code> if there is none.</p>

</dd>
<dt id="c"><b>c</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x441;&#x430;&#x43C;&#x43E; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x45B;&#x435; &#x431;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x435;.</p>

<p>&#x421;&#x430; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x446;&#x43E;&#x43C; &bdquo;<code>c</code>&ldquo; &bdquo;dos2unix&ldquo; &#x45B;&#x435; &#x438;&#x441;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x441;&#x430;&#x434;&#x440;&#x436;&#x435; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;, &bdquo;unix2dos&ldquo; &#x45B;&#x435; &#x438;&#x441;&#x43F;&#x438;&#x441;&#x430;&#x442; &#x441;&#x430;&#x43C;&#x43E; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43A;&#x43E;&#x458;&#x435; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;.</p>

<p>If in addition option <code>-e</code> or <code>--add-eol</code> is used also the files that lack a line break on the last line will be printed.</p>

</dd>
<dt id="h"><b>h</b></dt>
<dd>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x437;&#x430;&#x433;&#x43B;&#x430;&#x432;&#x459;&#x435;.</p>

</dd>
<dt id="p"><b>p</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x431;&#x435;&#x437; &#x43F;&#x443;&#x442;&#x430;&#x45A;&#x435;.</p>

</dd>
</dl>

<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x438;:</p>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x435; &#x437;&#x430; &#x441;&#x432;&#x435; &bdquo;*.txt&ldquo; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;:</p>

<pre><code>dos2unix -i *.txt</code></pre>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x441;&#x430;&#x43C;&#x43E; &#x431;&#x440;&#x43E;&#x458; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &#x438; &#x431;&#x440;&#x43E;&#x458; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;:</p>

<pre><code>dos2unix -idu *.txt</code></pre>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x441;&#x430;&#x43C;&#x43E; &#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430;:</p>

<pre><code>dos2unix --info=b *.txt</code></pre>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430;:</p>

<pre><code>dos2unix -ic *.txt</code></pre>

<p>&#x418;&#x441;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430;:</p>

<pre><code>unix2dos -ic *.txt</code></pre>

<p>List the files that have DOS line breaks or lack a line break on the last line:</p>

<pre><code>dos2unix -e -ic *.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x441;&#x430;&#x43C;&#x43E; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430; &#x438; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x459;&#x430; &#x434;&#x440;&#x443;&#x433;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43D;&#x435;&#x442;&#x430;&#x43A;&#x43D;&#x443;&#x442;&#x438;&#x43C;:</p>

<pre><code>dos2unix -ic0 *.txt | xargs -0 dos2unix</code></pre>

<p>&#x41D;&#x430;&#x43B;&#x430;&#x437;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430;:</p>

<pre><code>find -name &#39;*.txt&#39; -print0 | xargs -0 dos2unix -ic</code></pre>

</dd>
<dt id="k---keepdate"><b>-k, --keepdate</b></dt>
<dd>

<p>&#x417;&#x430;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430; &#x43F;&#x435;&#x447;&#x430;&#x442; &#x434;&#x430;&#x442;&#x443;&#x43C;&#x430; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x438;&#x441;&#x442;&#x438;&#x43C; &#x43A;&#x430;&#x43E; &#x43A;&#x43E;&#x434; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x435;.</p>

</dd>
<dt id="L---license"><b>-L, --license</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x43B;&#x438;&#x446;&#x435;&#x43D;&#x446;&#x443; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;.</p>

</dd>
<dt id="l---newline"><b>-l, --newline</b></dt>
<dd>

<p>&#x414;&#x43E;&#x434;&#x430;&#x458;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43D;&#x438; &#x43D;&#x43E;&#x432;&#x438; &#x440;&#x435;&#x434;.</p>

<p><b>dos2unix</b>: &#x421;&#x430;&#x43C;&#x43E; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &#x441;&#x435; &#x43C;&#x435;&#x45A;&#x430;&#x458;&#x443; &#x443; &#x434;&#x432;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;. &#x423; &#x41C;&#x435;&#x43A; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x441;&#x430;&#x43C;&#x43E; &#x41C;&#x435;&#x43A; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &#x441;&#x435; &#x43C;&#x435;&#x45A;&#x430;&#x458;&#x443; &#x443; &#x434;&#x432;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;.</p>

<p><b>unix2dos</b>: &#x421;&#x430;&#x43C;&#x43E; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &#x441;&#x435; &#x43C;&#x435;&#x45A;&#x430;&#x458;&#x443; &#x443; &#x434;&#x432;&#x430; &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;. &#x423; &#x41C;&#x435;&#x43A; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &#x441;&#x435; &#x43C;&#x435;&#x45A;&#x430;&#x458;&#x443; &#x443; &#x434;&#x432;&#x430; &#x41C;&#x435;&#x43A; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;.</p>

</dd>
<dt id="m---add-bom"><b>-m, --add-bom</b></dt>
<dd>

<p>&#x41F;&#x438;&#x448;&#x435; &#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430; (BOM) &#x443; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443;. &#x41F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x441;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x423;&#x422;&#x424;-8 &#x41E;&#x420;&#x411;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x458;&#x435; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x423;&#x422;&#x424;-16, &#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x441;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<code>-u</code>&ldquo;, &#x431;&#x438;&#x45B;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x423;&#x422;&#x424;-16 &#x41E;&#x420;&#x411;.</p>

<p>&#x41D;&#x438;&#x43A;&#x430;&#x434;&#x430; &#x43D;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x432;&#x443; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &#x43A;&#x430;&#x434;&#x430; &#x458;&#x435; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x43E; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x434;&#x440;&#x443;&#x433;&#x430;&#x447;&#x438;&#x458;&#x435; &#x43E;&#x434; &bdquo;UTF-8&ldquo;, &bdquo;UTF-16&ldquo;, &#x438;&#x43B;&#x438; &bdquo;GB18030&ldquo;. &#x412;&#x438;&#x434;&#x438;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43E;&#x434;&#x435;&#x459;&#x430;&#x43A; &#x408;&#x423;&#x41D;&#x418;&#x41A;&#x41E;&#x414;.</p>

</dd>
<dt id="n---newfile-_-_"><b>-n, --newfile &#x423;&#x41B;&#x410;&#x417;&#x41D;&#x410;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; &#x418;&#x417;&#x41B;&#x410;&#x417;&#x41D;&#x410;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; ...</b></dt>
<dd>

<p>&#x41D;&#x43E;&#x432;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x423;&#x41B;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; &#x438; &#x43F;&#x438;&#x448;&#x435; &#x438;&#x437;&#x43B;&#x430;&#x437; &#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x418;&#x417;&#x41B;_&#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410;. &#x41D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43C;&#x43E;&#x440;&#x430;&#x458;&#x443; &#x431;&#x438;&#x442;&#x438; &#x434;&#x430;&#x442;&#x438; &#x443; &#x43F;&#x430;&#x440;&#x43E;&#x432;&#x438;&#x43C;&#x430; &#x438; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x45F;&#x43E;&#x43A;&#x435;&#x440;&#x430; &#x441;&#x435; &bdquo;<i>&#x43D;&#x435;</i>&ldquo; &#x43C;&#x43E;&#x433;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x438;&#x43B;&#x438; &bdquo;<i>&#x45B;&#x435;&#x442;&#x435;</i>&ldquo; &#x438;&#x437;&#x433;&#x443;&#x431;&#x438;&#x442;&#x438; &#x441;&#x432;&#x43E;&#x458;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;.</p>

<p>&#x41E;&#x441;&#x43E;&#x431;&#x430; &#x43A;&#x43E;&#x458;&#x430; &#x437;&#x430;&#x43F;&#x43E;&#x447;&#x43D;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43D;&#x43E;&#x432;&#x435; (&#x443;&#x43F;&#x430;&#x440;&#x435;&#x43D;&#x435;) &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x431;&#x438;&#x45B;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x41E;&#x432;&#x43B;&#x430;&#x448;&#x45B;&#x435;&#x45A;&#x430; &#x437;&#x430; &#x447;&#x438;&#x442;&#x430;&#x45A;&#x435;/&#x43F;&#x438;&#x441;&#x430;&#x45A;&#x435; &#x43D;&#x43E;&#x432;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x431;&#x438;&#x45B;&#x435; &#x43E;&#x432;&#x43B;&#x430;&#x448;&#x45B;&#x435;&#x45A;&#x435; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43C;&#x430;&#x45A;&#x435; &bdquo;umask(1)&ldquo; &#x43E;&#x441;&#x43E;&#x431;&#x435; &#x43A;&#x43E;&#x458;&#x430; &#x43F;&#x43E;&#x43A;&#x440;&#x435;&#x45B;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435;.</p>

</dd>
<dt id="no-allow-chown"><b>--no-allow-chown</b></dt>
<dd>

<p>&#x41D;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x459;&#x430;&#x432;&#x430; &#x434;&#x430; &#x441;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x435; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x441;&#x442;&#x430;&#x440;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;.</p>

<p>&#x41F;&#x440;&#x435;&#x43A;&#x438;&#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x43A;&#x430;&#x434;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x438;/&#x438;&#x43B;&#x438; &#x433;&#x440;&#x443;&#x43F;&#x435; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x438;&#x442;&#x438; &#x43E;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43E; &#x443; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x422;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &bdquo;<code>-o</code>&ldquo; &#x438; &bdquo;<code>-n</code>&ldquo;. &#x41E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &#x458;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E; &#x430;&#x43A;&#x43E; &bdquo;dos2unix&ldquo; &#x438;&#x43C;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x443; &#x437;&#x430; &#x43E;&#x447;&#x443;&#x432;&#x430;&#x45A;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x438; &#x433;&#x440;&#x443;&#x43F;&#x430; &#x43D;&#x430;&#x434; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430;.</p>

</dd>
<dt id="no-add-eol"><b>--no-add-eol</b></dt>
<dd>

<p>&#x41D;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x458;&#x435; &#x43F;&#x440;&#x435;&#x43A;&#x438;&#x434; &#x440;&#x435;&#x434;&#x430; &#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x45A;&#x438; &#x440;&#x435;&#x434; &#x430;&#x43A;&#x43E; &#x433;&#x430; &#x43D;&#x435;&#x43C;&#x430;.</p>

</dd>
<dt id="O---to-stdout"><b>-O, --to-stdout</b></dt>
<dd>

<p>&#x41F;&#x438;&#x448;&#x435; &#x43D;&#x430; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x434;&#x43D;&#x438; &#x438;&#x437;&#x43B;&#x430;&#x437;, &#x43A;&#x430;&#x43E; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x444;&#x438;&#x43B;&#x442;&#x435;&#x440;. &#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;-o&ldquo; &#x434;&#x430; &#x441;&#x435; &#x432;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x43D;&#x430; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x441;&#x442;&#x430;&#x440;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; (&#x43E;&#x434;&#x43C;&#x430;&#x445;).</p>

<p>&#x417;&#x430;&#x458;&#x435;&#x434;&#x43D;&#x43E; &#x441;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x43E;&#x43C; &bdquo;-e&ldquo; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43D;&#x43E; &#x43D;&#x430;&#x434;&#x43E;&#x432;&#x435;&#x437;&#x430;&#x442;&#x438;. &#x41D;&#x435;&#x43C;&#x430; &#x441;&#x442;&#x43E;&#x43F;&#x459;&#x435;&#x43D;&#x43E;&#x433; &#x43F;&#x440;&#x432;&#x43E;&#x433; &#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x45A;&#x435;&#x433; &#x440;&#x435;&#x434;&#x430;, &#x438; &#x43D;&#x435;&#x43C;&#x430; &#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x435; &#x43F;&#x43E;&#x440;&#x435;&#x442;&#x43A;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x431;&#x430;&#x458;&#x442;&#x430; &#x43F;&#x43E; &#x441;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x438; &#x43D;&#x430;&#x434;&#x43E;&#x432;&#x435;&#x437;&#x430;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>

<pre><code>dos2unix -e -O &#x434;&#x442;&#x442;&#x43A;&#x430;1.txt &#x434;&#x442;&#x442;&#x43A;&#x430;2.txt &gt; &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

</dd>
<dt id="o---oldfile"><b>-o, --oldfile &#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; ...</b></dt>
<dd>

<p>&#x420;&#x435;&#x436;&#x438;&#x43C; &#x441;&#x442;&#x430;&#x440;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x414;&#x410;&#x422;&#x41E;&#x422;&#x415;&#x41A;&#x410; &#x438; &#x43F;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x438;&#x437;&#x43B;&#x430;&#x437; &#x443; &#x45A;&#x443;. &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x440;&#x430;&#x434;&#x438; &#x443; &#x43E;&#x432;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443;. &#x40F;&#x43E;&#x43A;&#x435;&#x440;&#x438; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430; &#x441;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438;.</p>

<p>&#x423; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x441;&#x442;&#x430;&#x440;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; (&#x443; &#x43C;&#x435;&#x441;&#x442;&#x443;) &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x434;&#x43E;&#x431;&#x438;&#x458;&#x430; &#x438;&#x441;&#x442;&#x430; &#x43E;&#x432;&#x43B;&#x430;&#x448;&#x45B;&#x435;&#x45A;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430;, &#x433;&#x440;&#x443;&#x43F;&#x435; &#x438; &#x447;&#x438;&#x442;&#x430;&#x45A;&#x430;/&#x43F;&#x438;&#x441;&#x430;&#x45A;&#x430; &#x43A;&#x430;&#x43E; &#x438; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;. &#x422;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43A;&#x430;&#x434;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A; &#x43A;&#x43E;&#x458;&#x438; &#x438;&#x43C;&#x430; &#x43E;&#x432;&#x43B;&#x430;&#x448;&#x45B;&#x435;&#x45A;&#x435; &#x43F;&#x438;&#x441;&#x430;&#x45A;&#x430; &#x43D;&#x430;&#x434; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x43E;&#x43C; (&#x43D;&#x43F;&#x440;. &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A; &#x430;&#x434;&#x43C;&#x438;&#x43D;&#x438;&#x441;&#x442;&#x440;&#x430;&#x442;&#x43E;&#x440;). &#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x45B;&#x435; &#x441;&#x435; &#x43F;&#x440;&#x435;&#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438; &#x43A;&#x430;&#x434;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x431;&#x438;&#x43B;&#x43E; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x435; &#x43E;&#x447;&#x443;&#x432;&#x430;&#x442;&#x438; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x435; &#x432;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x434;&#x430; &#x43F;&#x440;&#x432;&#x43E;&#x431;&#x438;&#x442;&#x43D;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A; &#x432;&#x438;&#x448;&#x435; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430; &#x447;&#x438;&#x442;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443;. &#x41F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x430; &#x433;&#x440;&#x443;&#x43F;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x459;&#x430;&#x442;&#x438; &#x431;&#x435;&#x437;&#x431;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x43D;&#x438; &#x440;&#x438;&#x437;&#x438;&#x43A;, &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x438; &#x447;&#x438;&#x442;&#x459;&#x438;&#x432;&#x430; &#x43E;&#x434; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x430; &#x43A;&#x43E;&#x458;&#x438;&#x43C;&#x430; &#x43D;&#x438;&#x458;&#x435; &#x43D;&#x430;&#x43C;&#x435;&#x45A;&#x435;&#x43D;&#x430;. &#x41E;&#x447;&#x443;&#x432;&#x430;&#x45A;&#x435; &#x43E;&#x432;&#x43B;&#x430;&#x448;&#x45B;&#x435;&#x45A;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x430;, &#x433;&#x440;&#x443;&#x43F;&#x435; &#x438; &#x447;&#x438;&#x442;&#x430;&#x45A;&#x430;/&#x43F;&#x438;&#x441;&#x430;&#x45A;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x436;&#x430;&#x43D;&#x43E; &#x458;&#x435; &#x441;&#x430;&#x43C;&#x43E; &#x43D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441;&#x443;.</p>

<p>&#x414;&#x430; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x435; &#x434;&#x430; &#x43B;&#x438; &bdquo;dos2unix&ldquo; &#x438;&#x43C;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x443; &#x43E;&#x447;&#x443;&#x432;&#x430;&#x45A;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x438; &#x433;&#x440;&#x443;&#x43F;&#x435; &#x43D;&#x430;&#x434; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x43E;&#x43C; &#x443;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &bdquo;<code>dos2unix -V</code>&ldquo;.</p>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x441;&#x435; &#x443;&#x432;&#x435;&#x43A; &#x432;&#x440;&#x448;&#x438; &#x43F;&#x443;&#x442;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x41A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430; &#x434;&#x43E;&#x433;&#x43E;&#x434;&#x438; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x430;, &#x43F;&#x440;&#x438;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x441;&#x435; &#x431;&#x440;&#x438;&#x448;&#x435; &#x430; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43E;&#x441;&#x442;&#x430;&#x458;&#x435; &#x43D;&#x435;&#x442;&#x430;&#x43A;&#x43D;&#x443;&#x442;&#x430;. &#x41A;&#x430;&#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x443;&#x441;&#x43F;&#x435;, &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x441;&#x435; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43E;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x43E;&#x43C;. &#x41C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x443; &#x437;&#x430; &#x43F;&#x438;&#x441;&#x430;&#x45A;&#x435; &#x43D;&#x430;&#x434; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x43E;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x43E;&#x43C;, &#x430;&#x43B;&#x438; &#x43D;&#x435;&#x43C;&#x430;&#x442;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x443; &#x434;&#x430; &#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x435; &#x438;&#x441;&#x442;&#x430; &#x441;&#x432;&#x43E;&#x458;&#x441;&#x442;&#x430;&#x432;&#x430; &#x43E;&#x432;&#x43B;&#x430;&#x448;&#x45B;&#x435;&#x45A;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x438;/&#x438;&#x43B;&#x438; &#x433;&#x440;&#x443;&#x43F; &#x443; &#x43F;&#x440;&#x438;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x43A;&#x430;&#x43E; &#x448;&#x442;&#x43E; &#x438;&#x43C;&#x430; &#x438; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;. &#x422;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438; &#x434;&#x430; &#x43D;&#x438;&#x441;&#x442;&#x435; &#x443; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x434;&#x430; &#x441;&#x430;&#x447;&#x443;&#x432;&#x430;&#x442;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43A;&#x430; &#x438;/&#x438;&#x43B;&#x438; &#x433;&#x440;&#x443;&#x43F;&#x435; &#x43D;&#x430;&#x434; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x43E;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x43E;&#x43C;. &#x423; &#x43E;&#x432;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x458;&#x443; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>--allow-chown</code>&ldquo; &#x434;&#x430; &#x43D;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x435; &#x441;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435;&#x43C;:</p>

<pre><code>dos2unix --allow-chown foo.txt</code></pre>

<p>&#x414;&#x440;&#x443;&#x433;&#x430; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x43D;&#x43E;&#x441;&#x442; &#x458;&#x435; &#x434;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43D;&#x43E;&#x432;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;:</p>

<pre><code>dos2unix -n foo.txt foo.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &bdquo;<code>--allow-chown</code>&ldquo; &#x458;&#x435; &#x434;&#x430; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x45F;&#x43E;&#x43A;&#x435;&#x440;&#x435;, &#x430; &#x441;&#x432;&#x43E;&#x458;&#x441;&#x442;&#x432;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x448;&#x442;&#x432;&#x430; &#x431;&#x438;&#x45B;&#x435; &#x43E;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x430; &#x43A;&#x430;&#x434;&#x430; &#x458;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x435;.</p>

</dd>
<dt id="q---quiet"><b>-q, --quiet</b></dt>
<dd>

<p>&#x422;&#x438;&#x445;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C;. &#x41F;&#x43E;&#x442;&#x438;&#x441;&#x43A;&#x443;&#x458;&#x435; &#x441;&#x432;&#x430; &#x443;&#x43F;&#x43E;&#x437;&#x43E;&#x440;&#x435;&#x45A;&#x430; &#x438; &#x43F;&#x43E;&#x440;&#x443;&#x43A;&#x435;. &#x420;&#x435;&#x437;&#x443;&#x43B;&#x442;&#x430;&#x43D;&#x442;&#x43D;&#x430; &#x432;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x458;&#x435; &#x43D;&#x443;&#x43B;&#x430;. &#x41E;&#x441;&#x438;&#x43C; &#x43A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x435; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &#x43B;&#x438;&#x43D;&#x438;&#x458;&#x435; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x438;.</p>

</dd>
<dt id="r---remove-bom"><b>-r, --remove-bom</b></dt>
<dd>

<p>&#x423;&#x43A;&#x43B;&#x430;&#x45A;&#x430; &#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430; (BOM). &#x41D;&#x435; &#x43F;&#x438;&#x448;&#x435; &#x41E;&#x420;&#x411; &#x443; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443;. &#x41E;&#x432;&#x43E; &#x458;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x430;&#x448;&#x430;&#x45A;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x435; &#x440;&#x435;&#x434;&#x430;. &#x412;&#x438;&#x434;&#x438;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-b</code>&ldquo;.</p>

</dd>
<dt id="s---safe"><b>-s, --safe</b></dt>
<dd>

<p>&#x41F;&#x440;&#x435;&#x441;&#x43A;&#x430;&#x447;&#x435; &#x438;&#x437;&#x432;&#x440;&#x448;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; (&#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;).</p>

<p>&#x41F;&#x440;&#x435;&#x441;&#x43A;&#x430;&#x43A;&#x430;&#x45A;&#x435; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x432;&#x440;&#x448;&#x438; &#x441;&#x435; &#x43A;&#x430;&#x43A;&#x43E; &#x431;&#x438; &#x441;&#x435; &#x438;&#x437;&#x431;&#x435;&#x433;&#x43B;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x458;&#x43D;&#x435; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x435;. &#x418;&#x43C;&#x430;&#x458;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x43C;&#x443; &#x434;&#x430; &#x43E;&#x442;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x45A;&#x435; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43D;&#x438;&#x458;&#x435; 100% &#x43F;&#x43E;&#x443;&#x437;&#x434;&#x430;&#x43D;&#x43E;. &#x423; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430; &#x441;&#x435; &#x442;&#x440;&#x430;&#x436;&#x435; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x438; &#x441;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438; &#x43A;&#x43E;&#x458;&#x438; &#x441;&#x435; &#x43E;&#x431;&#x438;&#x447;&#x43D;&#x43E; &#x43D;&#x435; &#x43D;&#x430;&#x43B;&#x430;&#x437;&#x435; &#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430;. &#x41C;&#x43E;&#x433;&#x443;&#x45B;&#x435; &#x458;&#x435; &#x434;&#x430; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x441;&#x430;&#x434;&#x440;&#x436;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x43E;&#x431;&#x438;&#x447;&#x43D;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x435;. &#x422;&#x430;&#x43A;&#x432;&#x430; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x45B;&#x435; &#x441;&#x435; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x43E; &#x441;&#x43C;&#x430;&#x442;&#x440;&#x430;&#x442;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x43E;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x43E;&#x43C;.</p>

</dd>
<dt id="u---keep-utf16"><b>-u, --keep-utf16</b></dt>
<dd>

<p>&#x417;&#x430;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x43E; &#x423;&#x422;&#x424;-16 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;. &#x418;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x431;&#x438;&#x45B;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x443; &#x438;&#x441;&#x442;&#x43E;&#x43C; &#x423;&#x422;&#x424;-16 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x443;, &#x43C;&#x430;&#x43B;&#x43E;&#x43C; &#x438;&#x43B;&#x438; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43A;&#x440;&#x430;&#x458;&#x43D;&#x43E;&#x448;&#x45B;&#x443;, &#x43A;&#x430;&#x43E; &#x438; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;. &#x41E;&#x432;&#x43E; &#x441;&#x43F;&#x440;&#x435;&#x447;&#x430;&#x432;&#x430; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x458; &#x443; &#x423;&#x422;&#x424;-8. &#x423;&#x422;&#x424;-16 &#x41E;&#x420;&#x411; &#x431;&#x438;&#x45B;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D; &#x443; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x441; &#x442;&#x438;&#x43C;. &#x41E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &#x441;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43E;&#x43D;&#x435;&#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x45B;&#x443; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &bdquo;<code>-ascii</code>&ldquo;.</p>

</dd>
<dt id="ul---assume-utf16le"><b>-ul, --assume-utf16le</b></dt>
<dd>

<p>&#x41F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430; &#x434;&#x430; &#x458;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &bdquo;UTF-16LE&ldquo;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x458;&#x438; &#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x430; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430; &#x443; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x43E;&#x458; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x446;&#x438; &#x41E;&#x420;&#x411; &#x438;&#x43C;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x43D;&#x430;&#x434; &#x43E;&#x432;&#x43E;&#x43C; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x43E;&#x43C;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x441;&#x442;&#x435; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x442;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43B;&#x438; (&#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43D;&#x438;&#x458;&#x435; &#x431;&#x438;&#x43B;&#x430; &#x443; &#x423;&#x422;&#x424;-16&#x41B;&#x415; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;) &#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x458;&#x435; &#x443;&#x441;&#x43F;&#x435;&#x43B;&#x43E;, &#x434;&#x43E;&#x431;&#x438;&#x45B;&#x435;&#x442;&#x435; &#x423;&#x422;&#x424;-8 &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x441;&#x430; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x438;&#x43C; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x43C;. &#x41F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x430; &#x43E;&#x43F;&#x43E;&#x437;&#x43E;&#x432;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43C;&#x43E;&#x45B;&#x443; &bdquo;iconv(1)&ldquo; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435;&#x43C; &#x423;&#x422;&#x424;-8 &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43D;&#x430;&#x437;&#x430;&#x434; &#x443; &#x423;&#x422;&#x424;-16&#x41B;&#x415;. &#x41E;&#x432;&#x43E; &#x45B;&#x435; &#x432;&#x440;&#x430;&#x442;&#x438;&#x442;&#x438; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443;.</p>

<p>&#x41F;&#x440;&#x435;&#x442;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x430; &#x423;&#x422;&#x424;-16&#x41B;&#x415; &#x440;&#x430;&#x434;&#x438; &#x43A;&#x430;&#x43E; &bdquo;<i>conversion mode</i>&ldquo;. &#x41F;&#x440;&#x435;&#x431;&#x430;&#x446;&#x438;&#x432;&#x430;&#x45A;&#x435;&#x43C; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x438; &bdquo;<i>ascii</i>&ldquo; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x423;&#x422;&#x424;-16&#x41B;&#x415; &#x43F;&#x440;&#x435;&#x442;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x430; &#x441;&#x435; &#x438;&#x441;&#x43A;&#x459;&#x443;&#x447;&#x443;&#x458;&#x435;.</p>

</dd>
<dt id="ub---assume-utf16be"><b>-ub, --assume-utf16be</b></dt>
<dd>

<p>&#x41F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430; &#x434;&#x430; &#x458;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &bdquo;UTF-16BE&ldquo;.</p>

<p>&#x41E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &#x440;&#x430;&#x434;&#x438; &#x438;&#x441;&#x442;&#x43E; &#x43A;&#x430;&#x43E; &#x438; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<code>-ul</code>&ldquo;.</p>

</dd>
<dt id="v---verbose"><b>-v, --verbose</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x43E;&#x43F;&#x448;&#x438;&#x440;&#x43D;&#x435; &#x43F;&#x43E;&#x440;&#x443;&#x43A;&#x435;. &#x414;&#x43E;&#x434;&#x430;&#x442;&#x43D;&#x435; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x458;&#x435; &#x441;&#x435; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x443; &#x43E; &#x41E;&#x437;&#x43D;&#x430;&#x446;&#x438; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430; &#x438; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x438;&#x43D;&#x438; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430;.</p>

</dd>
<dt id="F---follow-symlink"><b>-F, --follow-symlink</b></dt>
<dd>

<p>&#x41F;&#x440;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438;&#x447;&#x43A;&#x435; &#x432;&#x435;&#x437;&#x435; &#x438; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x446;&#x438;&#x459;&#x435;&#x432;&#x435;.</p>

</dd>
<dt id="R---replace-symlink"><b>-R, --replace-symlink</b></dt>
<dd>

<p>&#x417;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &#x441;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438;&#x447;&#x43A;&#x435; &#x432;&#x435;&#x437;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430; (&#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x435; &#x446;&#x438;&#x459;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x458;&#x443; &#x43D;&#x435;&#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x45A;&#x435;&#x43D;&#x435;).</p>

</dd>
<dt id="S---skip-symlink"><b>-S, --skip-symlink</b></dt>
<dd>

<p>&#x417;&#x430;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430; &#x43D;&#x435;&#x438;&#x437;&#x43C;&#x435;&#x45A;&#x435;&#x43D;&#x438;&#x43C; &#x441;&#x438;&#x43C;&#x431;&#x43E;&#x43B;&#x438;&#x447;&#x43A;&#x435; &#x432;&#x435;&#x437;&#x435; &#x438; &#x446;&#x438;&#x459;&#x435;&#x432;&#x435; (&#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;).</p>

</dd>
<dt id="V---version"><b>-V, --version</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x443;&#x458;&#x435; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x435; &#x43E; &#x438;&#x437;&#x434;&#x430;&#x45A;&#x443; &#x438; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x438;.</p>

</dd>
</dl>

<h1 id="4">&#x41C;&#x415;&#x41A; &#x420;&#x415;&#x416;&#x418;&#x41C;</h1>

<p>By default line breaks are converted from DOS to Unix and vice versa. Mac line breaks are not converted.</p>

<p>&#x423; &#x41C;&#x435;&#x43A; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &#x441;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x458;&#x443; &#x438;&#x437; &#x41C;&#x435;&#x43A;-&#x430; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x438; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x43E;. &#x414;&#x41E;&#x421; &#x43F;&#x440;&#x435;&#x43B;&#x430;&#x43C;&#x430;&#x45A;&#x430; &#x440;&#x435;&#x434;&#x430; &#x441;&#x435; &#x43D;&#x435; &#x43C;&#x435;&#x45A;&#x430;&#x458;&#x443;.</p>

<p>&#x414;&#x430; &#x43F;&#x43E;&#x43A;&#x440;&#x435;&#x43D;&#x435;&#x442;&#x435; &#x443; &#x41C;&#x435;&#x43A; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-c mac</code>&ldquo; &#x438;&#x43B;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x435; &bdquo;<code>mac2unix</code>&ldquo; &#x438;&#x43B;&#x438; &bdquo;<code>unix2mac</code>&ldquo;.</p>

<h1 id="5">&#x420;&#x415;&#x416;&#x418;&#x41C;&#x418; &#x41F;&#x420;&#x415;&#x422;&#x412;&#x410;&#x420;&#x410;&#x40A;&#x410;</h1>

<dl>

<dt id="ascii1"><b>ascii</b></dt>
<dd>

<p>This is the default conversion mode. This mode is for converting ASCII and ASCII-compatible encoded files, like UTF-8. Enabling <b>ascii</b> mode disables <b>7bit</b> and <b>iso</b> mode.</p>

<p>If dos2unix has UTF-16 support, UTF-16 encoded files are converted to the current locale character encoding on POSIX systems and to UTF-8 on Windows. Enabling <b>ascii</b> mode disables the option to keep UTF-16 encoding (<code>-u</code>) and the options to assume UTF-16 input (<code>-ul</code> and <code>-ub</code>). To see if dos2unix has UTF-16 support type <code>dos2unix -V</code>. See also section UNICODE.</p>

</dd>
<dt id="bit"><b>7bit</b></dt>
<dd>

<p>&#x423; &#x43E;&#x432;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x441;&#x432;&#x438; 8 &#x431;&#x438;&#x442;&#x43D;&#x438; &#x43D;&#x435;-&#x410;&#x421;&#x41A;&#x420;&#x418; &#x437;&#x43D;&#x430;&#x446;&#x438; (&#x441;&#x430; &#x432;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x438;&#x43C;&#x430; &#x43E;&#x434; 128 &#x434;&#x43E; 255) &#x441;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443; &#x443; 7 &#x431;&#x438;&#x442;&#x43D;&#x435; &#x440;&#x430;&#x437;&#x43C;&#x430;&#x43A;&#x435;.</p>

</dd>
<dt id="iso1"><b>iso</b></dt>
<dd>

<p>&#x417;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438; &#x441;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443; &#x438;&#x437;&#x43C;&#x435;&#x452;&#x443; &#x414;&#x41E;&#x421; &#x441;&#x43A;&#x443;&#x43F;&#x430; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x430; (&#x43A;&#x43E;&#x434;&#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;) &#x438; &#x418;&#x421;&#x41E; &#x441;&#x43A;&#x443;&#x43F;&#x430; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x430; &#x418;&#x421;&#x41E;-8859-1 (Latin-1) &#x43D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441;&#x443;. &#x414;&#x41E;&#x421; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438; &#x431;&#x435;&#x437; &#x418;&#x421;&#x41E;-8859-1 &#x435;&#x43A;&#x432;&#x438;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x430;, &#x437;&#x430; &#x43A;&#x43E;&#x458;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x43D;&#x438;&#x458;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x435;, &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443; &#x441;&#x435; &#x443; &#x442;&#x430;&#x447;&#x43A;&#x443;. &#x418;&#x441;&#x442;&#x43E; &#x441;&#x435; &#x440;&#x430;&#x447;&#x443;&#x43D;&#x430; &#x438; &#x437;&#x430; &#x418;&#x421;&#x41E;-8859-1 &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x435; &#x431;&#x435;&#x437; &#x414;&#x41E;&#x421;-&#x430;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<code>-iso</code>&ldquo;, &bdquo;dos2unix&ldquo; &#x45B;&#x435; &#x43F;&#x43E;&#x43A;&#x443;&#x448;&#x430;&#x442;&#x438; &#x434;&#x430; &#x43E;&#x434;&#x440;&#x435;&#x434;&#x438; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;. &#x41A;&#x430;&#x434;&#x430; &#x442;&#x43E; &#x43D;&#x438;&#x458;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x435;, &bdquo;dos2unix&ldquo; &#x45B;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x426;&#x41F;437, &#x43A;&#x43E;&#x458;&#x430; &#x441;&#x435; &#x443;&#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x443; &#x421;&#x410;&#x414;-&#x443;. &#x414;&#x430; &#x431;&#x438;&#x441;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x43E;&#x440;&#x430;&#x43B;&#x438; &#x43E;&#x434;&#x440;&#x435;&#x452;&#x435;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;, &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &bdquo;<code>-437</code>&ldquo; (&#x421;&#x410;&#x414;), &bdquo;<code>-850</code>&ldquo; (&#x437;&#x430;&#x43F;&#x430;&#x434;&#x43D;&#x43E;&#x435;&#x432;&#x440;&#x43E;&#x43F;&#x441;&#x43A;&#x438;), &bdquo;<code>-860</code>&ldquo; (&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x433;&#x430;&#x43B;&#x441;&#x43A;&#x438;), &bdquo;<code>-863</code>&ldquo; (&#x444;&#x440;&#x430;&#x43D;&#x446;&#x443;&#x441;&#x43A;&#x438; &#x43A;&#x430;&#x43D;&#x430;&#x434;&#x441;&#x43A;&#x438;) &#x438;&#x43B;&#x438; &bdquo;<code>-865</code>&ldquo; (&#x43D;&#x43E;&#x440;&#x434;&#x438;&#x458;&#x441;&#x43A;&#x438;). &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43A;&#x43E;&#x434;&#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430; &#x426;&#x41F;1252 (&#x437;&#x430;&#x43F;&#x430;&#x434;&#x43D;&#x43E;&#x435;&#x432;&#x440;&#x43E;&#x43F;&#x441;&#x43A;&#x438;) &#x458;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x436;&#x430;&#x43D;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x43E;&#x43C; &bdquo;<code>-1252</code>&ldquo;. &#x417;&#x430; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x435; &#x43A;&#x43E;&#x434;&#x43D;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &bdquo;dos2unix&ldquo; &#x443; &#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x446;&#x438;&#x458;&#x438; &#x441;&#x430; &bdquo;iconv(1)&ldquo;. &#x418;&#x43A;&#x43E;&#x43D;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438;&#x437;&#x43C;&#x435;&#x452;&#x443; &#x434;&#x443;&#x433;&#x43E;&#x433; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x430; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x430;.</p>

<p>&#x41D;&#x438;&#x43A;&#x430;&#x434;&#x430; &#x43D;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x418;&#x421;&#x41E; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x43D;&#x430;&#x434; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x438;&#x43C; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430;. &#x41E;&#x448;&#x442;&#x435;&#x442;&#x438;&#x45B;&#x435; &#x423;&#x422;&#x424;-8 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;.</p>

<p>&#x41D;&#x435;&#x43A;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x438;:</p>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x414;&#x41E;&#x421; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x435; &#x43A;&#x43E;&#x434;&#x43D;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; Latin-1:</p>

<pre><code>dos2unix -iso -n  &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x414;&#x41E;&#x421; CP850 &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; Latin-1:</p>

<pre><code>dos2unix -850 -n  &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; CP1252 &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; Latin-1:</p>

<pre><code>dos2unix -1252 -n  &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; CP1252 &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x423;&#x422;&#x424;-8 (&#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434;):</p>

<pre><code>iconv -f CP1252 -t UTF-8  &#x443;&#x43B;&#x430;&#x437;.txt | dos2unix &gt; &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; Latin-1 &#x443; &#x414;&#x41E;&#x421; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x443; &#x43A;&#x43E;&#x434;&#x43D;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;:</p>

<pre><code>unix2dos -iso -n &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; Latin-1 &#x443; &#x414;&#x41E;&#x421; CP850:</p>

<pre><code>unix2dos -850 -n &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; Latin-1 &#x443; &#x412;&#x43E;&#x43D;&#x434;&#x43E;&#x443;&#x437; CP1252:</p>

<pre><code>unix2dos -1252 -n &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x423;&#x422;&#x424;-8 (&#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434;) &#x443; &#x412;&#x43E;&#x43D;&#x434;&#x43E;&#x443;&#x437; CP1252:</p>

<pre><code>unix2dos &lt; &#x443;&#x43B;&#x430;&#x437;.txt | iconv -f UTF-8 -t CP1252 &gt; &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x412;&#x438;&#x434;&#x438;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; <a href="http://czyborra.com/charsets/codepages.html">http://czyborra.com/charsets/codepages.html</a> &#x438; <a href="http://czyborra.com/charsets/iso8859.html">http://czyborra.com/charsets/iso8859.html</a>.</p>

</dd>
</dl>

<h1 id="6">&#x423;&#x41D;&#x418;&#x41A;&#x41E;&#x414;</h1>

<h2 id="7">&#x41A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430;</h2>

<p>&#x41F;&#x43E;&#x441;&#x442;&#x43E;&#x458;&#x435; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x438;&#x442;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430;. &#x41D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441;&#x443; &#x438; &#x41B;&#x438;&#x43D;&#x443;&#x43A;&#x441;&#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x443; &#x43E;&#x431;&#x438;&#x447;&#x43D;&#x43E; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x443; &#x423;&#x422;&#x424;-8 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x443;. &#x41D;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x431;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x443; &#x423;&#x422;&#x424;-8, &#x423;&#x422;&#x424;-16 &#x438;&#x43B;&#x438; &#x423;&#x422;&#x424;-16 &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x458; &#x43A;&#x440;&#x430;&#x458;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x430;&#x43B;&#x438; &#x441;&#x443; &#x443;&#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x443; &#x423;&#x422;&#x424;-16 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;.</p>

<h2 id="8">&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435;</h2>

<p>Unicode text files can have DOS, Unix or Mac line breaks, like ASCII text files.</p>

<p>&#x421;&#x432;&#x430; &#x438;&#x437;&#x434;&#x430;&#x45A;&#x430; &bdquo;dos2unix&ldquo;-&#x430; &#x438; &bdquo;unix2do&ldquo;-&#x430; &#x43C;&#x43E;&#x433;&#x443; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x423;&#x422;&#x424;-8 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;, &#x458;&#x435;&#x440; &#x458;&#x435; &#x423;&#x422;&#x424;-8 &#x434;&#x438;&#x437;&#x430;&#x458;&#x43D;&#x438;&#x440;&#x430;&#x43D; &#x437;&#x430; &#x43F;&#x43E;&#x432;&#x440;&#x430;&#x442;&#x43D;&#x443; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x43D;&#x43E;&#x441;&#x442; &#x441;&#x430; &#x410;&#x421;&#x41A;&#x420;&#x418;-&#x438;&#x458;&#x435;&#x43C;.</p>

<p>&bdquo;dos2unix&ldquo; &#x438; &bdquo;unix2dos&ldquo; &#x441;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x423;&#x422;&#x424;-16 &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x43E;&#x43C;, &#x43C;&#x43E;&#x436;&#x435; &#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x423;&#x422;&#x424;-16 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43C;&#x430;&#x43B;&#x435; &#x438; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x435; &#x43A;&#x440;&#x430;&#x458;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x414;&#x430; &#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x434;&#x430; &#x43B;&#x438; &#x458;&#x435; &bdquo;dos2unix&ldquo; &#x438;&#x437;&#x433;&#x440;&#x430;&#x452;&#x435;&#x43D; &#x441;&#x430; &#x423;&#x422;&#x424;-16 &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x43E;&#x43C; &#x443;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &bdquo;<code>dos2unix -V</code>&ldquo;.</p>

<p>&#x41D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441;&#x443;/&#x41B;&#x438;&#x43D;&#x443;&#x43A;&#x441;&#x443; &#x423;&#x422;&#x424;-16 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443; &#x443; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x43D;&#x43E; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x430;. &#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x443; &bdquo;locale(1)&ldquo; &#x434;&#x430; &#x441;&#x430;&#x437;&#x43D;&#x430;&#x442;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x458;&#x435; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x430; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x458;&#x435;. &#x41A;&#x430;&#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x43D;&#x438;&#x458;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x435;, &#x434;&#x435;&#x441;&#x438;&#x45B;&#x435; &#x441;&#x435; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430; &#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x45B;&#x435; &#x431;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x441;&#x43A;&#x43E;&#x447;&#x435;&#x43D;&#x430;.</p>

<p>&#x41D;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443; &#x443; &#x423;&#x422;&#x424;-8. &#x423;&#x422;&#x424;-8 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x443; &#x434;&#x43E;&#x431;&#x440;&#x43E; &#x43F;&#x43E;&#x434;&#x440;&#x436;&#x430;&#x43D;&#x435; &#x438; &#x43D;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443; &#x438; &#x43D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441;/&#x41B;&#x438;&#x43D;&#x443;&#x43A;&#x441;&#x443;.</p>

<p>&#x423;&#x422;&#x424;-16 &#x438; &#x423;&#x422;&#x424;-8 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x430; &#x441;&#x443; &#x443; &#x43F;&#x43E;&#x442;&#x43F;&#x443;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x43D;&#x430;, &#x443; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x443; &#x441;&#x435; &#x43D;&#x435;&#x45B;&#x435; &#x438;&#x437;&#x433;&#x443;&#x431;&#x438;&#x442;&#x438; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x430;&#x432; &#x442;&#x435;&#x43A;&#x441;&#x442;. &#x41A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x434;&#x43E;&#x433;&#x43E;&#x434;&#x438; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430; &#x423;&#x422;&#x424;-16 &#x443; &#x423;&#x422;&#x424;-8, &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x43A;&#x430;&#x434;&#x430; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x441;&#x430;&#x434;&#x440;&#x436;&#x438; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x443;, &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x45B;&#x435; &#x431;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x441;&#x43A;&#x43E;&#x447;&#x435;&#x43D;&#x430;.</p>

<p>&#x41A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<code>-u</code>&ldquo;, &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x45B;&#x435; &#x431;&#x438;&#x442;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x443; &#x438;&#x441;&#x442;&#x43E;&#x43C; &#x423;&#x422;&#x424;-16 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x443; &#x43A;&#x430;&#x43E; &#x438; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;. &#x41E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<code>-u</code>&ldquo; &#x441;&#x43F;&#x440;&#x435;&#x447;&#x430;&#x432;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x443; &#x423;&#x422;&#x424;-8.</p>

<p>&bdquo;dos2unix&ldquo; &#x438; &bdquo;unix2dos&ldquo; &#x43D;&#x435;&#x43C;&#x430;&#x458;&#x443; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435; &#x423;&#x422;&#x424;-8 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x443; &#x423;&#x422;&#x424;-16.</p>

<p>&#x418;&#x421;&#x41E; &#x438; 7-&#x431;&#x438;&#x442;&#x43D;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430; &#x43D;&#x435; &#x440;&#x430;&#x434;&#x438; &#x43D;&#x430; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x430;.</p>

<h2 id="9">&#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x430; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430;</h2>

<p>On Windows Unicode text files typically have a Byte Order Mark (BOM), because many Windows programs (including Notepad) add BOMs by default. See also <a href="https://en.wikipedia.org/wiki/Byte_order_mark">https://en.wikipedia.org/wiki/Byte_order_mark</a>.</p>

<p>&#x41D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441;&#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43E;&#x431;&#x438;&#x447;&#x43D;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x458;&#x443; &#x41E;&#x420;&#x411;. &#x41F;&#x440;&#x435;&#x442;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x459;&#x430; &#x441;&#x435; &#x434;&#x430; &#x441;&#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x443; &#x458;&#x435;&#x437;&#x438;&#x447;&#x43A;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x443; &#x437;&#x43D;&#x430;&#x43A;&#x430;.</p>

<p>&bdquo;dos2unix&ldquo; &#x43C;&#x43E;&#x436;&#x435; &#x43E;&#x442;&#x43A;&#x440;&#x438;&#x442;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x434;&#x430; &#x43B;&#x438; &#x458;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x443; &#x423;&#x422;&#x424;-16 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443; &#x438; &#x434;&#x430; &#x43B;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x438;&#x43C;&#x430; &#x41E;&#x420;&#x411;. &#x41A;&#x430;&#x434;&#x430; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43D;&#x435;&#x43C;&#x430; &#x41E;&#x420;&#x411;, &bdquo;dos2unix&ldquo; &#x45B;&#x435; &#x432;&#x438;&#x434;&#x435;&#x442;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x43A;&#x430;&#x43E; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x443;.</p>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-ul</code>&ldquo; &#x438;&#x43B;&#x438; &bdquo;<code>-ub</code>&ldquo; &#x434;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x431;&#x435;&#x437; &#x41E;&#x420;&#x411;-&#x430;.</p>

<p>&bdquo;dos2unix&ldquo; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x43D;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x41E;&#x420;&#x411; &#x443; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443;. &#x421;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x43E;&#x43C; &bdquo;<code>-b</code>&ldquo; &bdquo;dos2unix &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x41E;&#x420;&#x411; &#x43A;&#x430;&#x434;&#x430; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x438;&#x43C;&#x430; &#x41E;&#x420;&#x411;.</p>

<p>&bdquo;unix2dos&ldquo; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x41E;&#x420;&#x411; &#x443; &#x438;&#x437;&#x43B;&#x430;&#x437;&#x43D;&#x443; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x43A;&#x430;&#x434;&#x430; &#x443;&#x43B;&#x430;&#x437;&#x43D;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x438;&#x43C;&#x430; &#x41E;&#x420;&#x411;. &#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-r</code>&ldquo; &#x434;&#x430; &#x443;&#x43A;&#x43B;&#x43E;&#x43D;&#x438;&#x442;&#x435; &#x41E;&#x420;&#x411;.</p>

<p>&bdquo;dos2unix&ldquo; &#x438; &bdquo;unix2dos&ldquo; &#x443;&#x432;&#x435;&#x43A; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x458;&#x435; &#x41E;&#x420;&#x411; &#x43A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &bdquo;<code>-m</code>&ldquo; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430;.</p>

<h2 id="10">&#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43D;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443;</h2>

<p>&bdquo;dos2unix&ldquo; &#x438;&#x43C;&#x430; &#x438;&#x437;&#x431;&#x43E;&#x440;&#x43D;&#x443; &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x443; &#x437;&#x430; &#x447;&#x438;&#x442;&#x430;&#x45A;&#x435; &#x438; &#x43F;&#x438;&#x441;&#x430;&#x45A;&#x435; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x443; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x458; &#x43B;&#x438;&#x43D;&#x438;&#x458;&#x438;. &#x422;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438; &#x434;&#x430; &bdquo;dos2unix&ldquo; &#x43C;&#x43E;&#x436;&#x435; &#x43E;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43A;&#x43E;&#x458;&#x435; &#x443; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x443; &#x438;&#x43C;&#x430;&#x458;&#x443; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x435; &#x43A;&#x43E;&#x458;&#x438; &#x43D;&#x438;&#x441;&#x443; &#x434;&#x435;&#x43E; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x43D;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x441;&#x43A;&#x435; &#x410;&#x41D;&#x421;&#x418; &#x43A;&#x43E;&#x434;&#x43D;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;. &#x414;&#x430; &#x431;&#x438;&#x441;&#x442;&#x435; &#x432;&#x438;&#x434;&#x435;&#x43B;&#x438; &#x434;&#x430; &#x43B;&#x438; &#x458;&#x435; &bdquo;dos2unix&ldquo; &#x437;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x438;&#x437;&#x433;&#x440;&#x430;&#x452;&#x435;&#x43D; &#x441;&#x430; &#x43F;&#x43E;&#x434;&#x440;&#x448;&#x43A;&#x43E;&#x43C; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x443;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &bdquo;<code>dos2unix -V</code>&ldquo;.</p>

<p>&#x41F;&#x43E;&#x441;&#x442;&#x43E;&#x458;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x441;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x43E;&#x43C; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x443; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x438;. &#x412;&#x438;&#x434;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-D</code>&ldquo;, &bdquo;<code>--display-enc</code>&ldquo;. &#x41D;&#x430;&#x437;&#x438;&#x432;&#x438; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43C;&#x43E;&#x433;&#x443; &#x431;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438; &#x443; &#x43A;&#x43E;&#x43D;&#x437;&#x43E;&#x43B;&#x438;, &#x430;&#x43B;&#x438; &#x45B;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x431;&#x438;&#x442;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x435; &#x43F;&#x43E;&#x434; &#x442;&#x430;&#x447;&#x43D;&#x438;&#x43C; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x43E;&#x43C;.</p>

<h2 id="11">&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x438; &#x423;&#x43D;&#x438;&#x43A;&#x43E;&#x434;&#x430;</h2>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438;&#x437; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x423;&#x422;&#x424;-16 (&#x441;&#x430; &#x41E;&#x420;&#x411;-&#x43E;&#x43C;) &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x423;&#x422;&#x424;-8:</p>

<pre><code>dos2unix -n &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438;&#x437; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x423;&#x422;&#x424;-16&#x41B;&#x415; (&#x431;&#x435;&#x437; &#x41E;&#x420;&#x411;-&#x430;) &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x423;&#x422;&#x424;-8:</p>

<pre><code>dos2unix -ul -n &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x423;&#x422;&#x424;-8 &#x443; &#x412;&#x43E;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x423;&#x422;&#x424;-8 &#x441;&#x430; &#x41E;&#x420;&#x411;-&#x43E;&#x43C;:</p>

<pre><code>unix2dos -m -n &#x443;&#x43B;&#x430;&#x437;.txt &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x438;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x423;&#x422;&#x424;-8 &#x443; &#x412;&#x43E;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x423;&#x422;&#x424;-16:</p>

<pre><code>unix2dos &lt; &#x443;&#x43B;&#x430;&#x437;.txt | iconv -f UTF-8 -t UTF-16 &gt; &#x438;&#x437;&#x43B;&#x430;&#x437;.txt</code></pre>

<h1 id="GB18030">GB18030</h1>

<p>GB18030 is a Chinese government standard. A mandatory subset of the GB18030 standard is officially required for all software products sold in China. See also <a href="https://en.wikipedia.org/wiki/GB_18030">https://en.wikipedia.org/wiki/GB_18030</a>.</p>

<p>&bdquo;GB18030&ldquo; &#x458;&#x435; &#x443; &#x43F;&#x43E;&#x442;&#x43F;&#x443;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x430;&#x43D; &#x441;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434;-&#x43E;&#x43C;, &#x438; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x435; &#x441;&#x43C;&#x430;&#x442;&#x440;&#x430;&#x442;&#x438; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x43E;&#x43C; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x458;&#x430;. &#x41A;&#x430;&#x43E; &#x423;&#x422;&#x424;-8, &bdquo;GB18030&ldquo; &#x458;&#x435; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x430;&#x43D; &#x441;&#x430; &#x410;&#x421;&#x41A;&#x420;&#x418;. &bdquo;GB18030&ldquo; &#x458;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x452;&#x435; &#x441;&#x430;&#x433;&#x43B;&#x430;&#x441;&#x430;&#x43D; &#x441;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43A;&#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x43E;&#x43C; 936, &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x442;&#x43E;&#x43C; &#x438; &#x43A;&#x430;&#x43E; &#x413;&#x411;&#x41A;.</p>

<p>&#x41D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441;&#x443;/&#x41B;&#x438;&#x43D;&#x443;&#x43A;&#x441;&#x443; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x435; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443; &#x443; &bdquo;GB18030&ldquo; &#x43A;&#x430;&#x434;&#x430; &#x458;&#x435; &#x458;&#x435;&#x437;&#x438;&#x447;&#x43A;&#x43E; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x459;&#x435;&#x43D;&#x43E; &#x43D;&#x430; &bdquo;GB18030&ldquo;. &#x417;&#x43D;&#x430;&#x458;&#x442;&#x435; &#x434;&#x430; &#x45B;&#x435; &#x43E;&#x432;&#x43E; &#x440;&#x430;&#x434;&#x438;&#x442;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x430;&#x43A;&#x43E; &#x458;&#x435; &#x458;&#x435;&#x437;&#x438;&#x43A; &#x43F;&#x43E;&#x434;&#x440;&#x436;&#x430;&#x43D; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43E;&#x43C;. &#x41A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x443; &bdquo;<code>locale -a</code>&ldquo; &#x434;&#x430; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x435; &#x441;&#x43F;&#x438;&#x441;&#x430;&#x43A; &#x43F;&#x43E;&#x434;&#x440;&#x436;&#x430;&#x43D;&#x438;&#x445; &#x458;&#x435;&#x437;&#x438;&#x43A;&#x430;.</p>

<p>&#x41D;&#x430; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437;&#x443; &#x442;&#x440;&#x435;&#x431;&#x430; &#x434;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x443; &bdquo;<code>-gb</code>&ldquo; &#x434;&#x430; &#x43F;&#x440;&#x435;&#x432;&#x435;&#x434;&#x435;&#x442;&#x435; &#x423;&#x422;&#x424;-16 &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x443; &bdquo;GB18030&ldquo;.</p>

<p>&bdquo;GB18030&ldquo; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x43D;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x438;&#x43C;&#x430;&#x442;&#x438; &#x41E;&#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x435;&#x434;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x430; &#x431;&#x430;&#x458;&#x442;&#x43E;&#x432;&#x430;, &#x43A;&#x430;&#x43E; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x43E;&#x434; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435;.</p>

<h1 id="12">&#x41F;&#x420;&#x418;&#x41C;&#x415;&#x420;&#x418;</h1>

<p>&#x427;&#x438;&#x442;&#x430; &#x443;&#x43B;&#x430;&#x437; &#x441;&#x430; &bdquo;&#x441;&#x442;&#x43D;&#x434;_&#x443;&#x43B;&#x430;&#x437;&#x430;&ldquo; &#x438; &#x43F;&#x438;&#x448;&#x435; &#x438;&#x437;&#x43B;&#x430;&#x437; &#x43D;&#x430; &bdquo;&#x441;&#x442;&#x43D;&#x434;_&#x438;&#x437;&#x43B;&#x430;&#x437;&ldquo;:</p>

<pre><code>dos2unix &lt; &#x430;.txt
cat &#x430;.txt | dos2unix</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x430;.txt&ldquo;. &#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x431;.txt&ldquo;:</p>

<pre><code>dos2unix &#x430;.txt &#x431;.txt
dos2unix -o &#x430;.txt &#x431;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x430;.txt&ldquo; &#x443; &#x430;&#x441;&#x43A;&#x440;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430;:</p>

<pre><code>dos2unix &#x430;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x430;.txt&ldquo; &#x443; &#x430;&#x441;&#x43A;&#x440;&#x438; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430;, &#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x431;.txt&ldquo; &#x443; 7&#x431;&#x438;&#x442;&#x43D;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x430;:</p>

<pre><code>dos2unix &#x430;.txt -c 7bit &#x431;.txt
dos2unix -c ascii &#x430;.txt -c 7bit &#x431;.txt
dos2unix -ascii &#x430;.txt -7 &#x431;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &bdquo;&#x430;.txt&ldquo; &#x438;&#x437; &#x41C;&#x435;&#x43A; &#x443; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;:</p>

<pre><code>dos2unix -c mac &#x430;.txt
mac2unix &#x430;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &bdquo;&#x430;.txt&ldquo; &#x438;&#x437; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x443; &#x41C;&#x435;&#x43A; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;:</p>

<pre><code>unix2dos -c mac &#x430;.txt
unix2mac &#x430;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x430;.txt&ldquo; &#x434;&#x43E;&#x43A; &#x437;&#x430;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430; &#x438;&#x437;&#x432;&#x43E;&#x440;&#x43D;&#x438; &#x43F;&#x435;&#x447;&#x430;&#x442; &#x434;&#x430;&#x442;&#x443;&#x43C;&#x430;:</p>

<pre><code>dos2unix -k &#x430;.txt
dos2unix -k -o &#x430;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &bdquo;&#x430;.txt&ldquo; &#x438; &#x43F;&#x438;&#x448;&#x435; &#x43D;&#x430; &bdquo;&#x435;.txt&ldquo;:</p>

<pre><code>dos2unix -n &#x430;.txt &#x435;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &bdquo;&#x430;.txt&ldquo; &#x438; &#x43F;&#x438;&#x448;&#x435; &#x43D;&#x430; &bdquo;&#x435;.txt&ldquo;, &#x437;&#x430;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430; &#x43F;&#x435;&#x447;&#x430;&#x442; &#x434;&#x430;&#x442;&#x443;&#x43C;&#x430; &bdquo;&#x435;.txt&ldquo;-&#x430; &#x438;&#x441;&#x442;&#x438;&#x43C; &#x43A;&#x430;&#x43E; &bdquo;&#x430;.txt&ldquo;:</p>

<pre><code>dos2unix -k -n &#x430;.txt &#x435;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x430;.txt&ldquo;, &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &bdquo;&#x431;.txt&ldquo; &#x438; &#x43F;&#x438;&#x448;&#x435; &#x43D;&#x430; &bdquo;.txt&ldquo;:</p>

<pre><code>dos2unix &#x430;.txt -n &#x431;.txt &#x435;.txt
dos2unix -o &#x430;.txt -n &#x431;.txt &#x435;.txt</code></pre>

<p>&#x41F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &bdquo;&#x446;.txt&ldquo; &#x438; &#x43F;&#x438;&#x448;&#x435; &#x43D;&#x430; &bdquo;&#x435;.txt&ldquo;, &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435;&bdquo;&#x430;.txt&ldquo;, &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &#x438; &#x437;&#x430;&#x43C;&#x435;&#x45A;&#x443;&#x458;&#x435; &bdquo;&#x431;.txt&ldquo;, &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430; &bdquo;&#x434;.txt&ldquo; &#x438; &#x43F;&#x438;&#x448;&#x435; &#x443; &bdquo;&#x444;.txt&ldquo;:</p>

<pre><code>dos2unix -n &#x446;.txt &#x435;.txt -o &#x430;.txt &#x431;.txt -n &#x434;.txt &#x444;.txt</code></pre>

<h1 id="13">&#x414;&#x423;&#x411;&#x418;&#x41D;&#x421;&#x41A;&#x41E; &#x41F;&#x420;&#x415;&#x422;&#x412;&#x410;&#x420;&#x410;&#x40A;&#x415;</h1>

<p>&#x423; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x448;&#x43A;&#x43E;&#x459;&#x446;&#x438; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x435; &bdquo;find(1)&ldquo; &#x438; &bdquo;xargs(1)&ldquo; &#x441;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x437;&#x430; &#x43F;&#x43E;&#x43A;&#x440;&#x435;&#x442;&#x430;&#x45A;&#x435; &bdquo;dos2unix&ldquo;-&#x430; &#x434;&#x443;&#x431;&#x438;&#x43D;&#x441;&#x43A;&#x438; &#x43F;&#x440;&#x435;&#x43A;&#x43E; &#x441;&#x432;&#x438;&#x445; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;&#x430;&#x43B;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x443; &#x441;&#x442;&#x430;&#x431;&#x43B;&#x443; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x458;&#x443;&#x43C;&#x430;. &#x41D;&#x430; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x437;&#x430; &#x43F;&#x440;&#x435;&#x442;&#x432;&#x430;&#x440;&#x430;&#x45A;&#x435; &#x441;&#x432;&#x438;&#x445; &bdquo;.txt&ldquo; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x443; &#x441;&#x442;&#x430;&#x431;&#x43B;&#x443; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x458;&#x443;&#x43C;&#x430; &#x43F;&#x43E;&#x434; &#x442;&#x435;&#x43A;&#x443;&#x45B;&#x438;&#x43C; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x458;&#x443;&#x43C;&#x43E;&#x43C; &#x443;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435;:</p>

<pre><code>find . -name &#39;*.txt&#39; -print0 |xargs -0 dos2unix</code></pre>

<p>&bdquo;find(1)&ldquo;-&#x43E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<code>-print0</code>&ldquo; &#x438; &#x43E;&#x434;&#x433;&#x43E;&#x432;&#x430;&#x440;&#x430;&#x458;&#x443;&#x45B;&#x430; &bdquo;xargs(1)&ldquo;-&#x43E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<code>-0</code>&ldquo; &#x441;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43D;&#x435; &#x43A;&#x430;&#x434;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x458;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x435; &#x441;&#x430; &#x440;&#x430;&#x437;&#x43C;&#x430;&#x446;&#x438;&#x43C;&#x430; &#x438; &#x43D;&#x430;&#x432;&#x43E;&#x434;&#x43D;&#x438;&#x446;&#x438;&#x43C;&#x430; &#x443; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x438;&#x43C;&#x430;. &#x423; &#x441;&#x443;&#x43F;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x43C; &#x441;&#x435; &#x43E;&#x432;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x438;&#x437;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438;. &#x414;&#x440;&#x443;&#x433;&#x430; &#x43C;&#x43E;&#x433;&#x443;&#x45B;&#x43D;&#x43E;&#x441;&#x442; &#x458;&#x435; &#x434;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x435; &bdquo;find(1)&ldquo; &#x441;&#x430; &bdquo;<code>-exec</code>&ldquo; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x43E;&#x43C;:</p>

<pre><code>find . -name &#39;*.txt&#39; -exec dos2unix {} \;</code></pre>

<p>&#x423; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x43C; &#x443;&#x43F;&#x438;&#x442;&#x443; &#x441;&#x43B;&#x435;&#x434;&#x435;&#x45B;&#x435; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x435; &#x441;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438;:</p>

<pre><code>for /R %G in (*.txt) do dos2unix &quot;%G&quot;</code></pre>

<p>&#x41A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x446;&#x438; &bdquo;PowerShell&ldquo;-&#x430; &#x43C;&#x43E;&#x433;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x441;&#x43B;&#x435;&#x434;&#x435;&#x45B;&#x435; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x435; &#x443; &#x412;&#x438;&#x43D;&#x434;&#x43E;&#x443;&#x437; &bdquo;PowerShell&ldquo;-&#x443;:</p>

<pre><code>get-childitem -path . -filter &#39;*.txt&#39; -recurse | foreach-object {dos2unix $_.Fullname}</code></pre>

<h1 id="14">&#x408;&#x415;&#x417;&#x418;&#x427;&#x415;&#x40A;&#x415;</h1>

<dl>

<dt id="15"><b>&#x408;&#x415;&#x417;</b></dt>
<dd>

<p>&#x41F;&#x440;&#x438;&#x43C;&#x430;&#x440;&#x43D;&#x438; &#x458;&#x435;&#x437;&#x438;&#x43A; &#x441;&#x435; &#x431;&#x438;&#x440;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x459;&#x438;&#x432;&#x43E;&#x43C; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x45A;&#x430; &bdquo;LANG&ldquo;. &#x41F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x459;&#x438;&#x432;&#x430; &bdquo;LANG&ldquo; &#x441;&#x435; &#x441;&#x430;&#x441;&#x442;&#x43E;&#x458;&#x438; &#x438;&#x437; &#x43D;&#x435;&#x43A;&#x43E;&#x43B;&#x438;&#x43A;&#x43E; &#x434;&#x435;&#x43B;&#x43E;&#x432;&#x430;. &#x41F;&#x440;&#x432;&#x438; &#x434;&#x435;&#x43E; &#x458;&#x435; &#x43C;&#x430;&#x43B;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x430; &#x458;&#x435;&#x437;&#x438;&#x447;&#x43A;&#x438; &#x43A;&#x43E;&#x434;. &#x414;&#x440;&#x443;&#x433;&#x438; &#x458;&#x435; &#x43D;&#x435;&#x43E;&#x431;&#x430;&#x432;&#x435;&#x437;&#x430;&#x43D; &#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x459;&#x430; &#x43A;&#x43E;&#x434; &#x434;&#x440;&#x436;&#x430;&#x432;&#x435; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x430;, &#x43A;&#x43E;&#x458;&#x435;&#x43C; &#x43F;&#x440;&#x435;&#x442;&#x445;&#x43E;&#x434;&#x438; &#x434;&#x43E;&#x45A;&#x430; &#x446;&#x440;&#x442;&#x430;. &#x422;&#x443; &#x458;&#x435; &#x438; &#x438;&#x437;&#x431;&#x43E;&#x440;&#x43D;&#x438; &#x442;&#x440;&#x435;&#x45B;&#x438; &#x434;&#x435;&#x43E;: &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x430;, &#x43A;&#x43E;&#x458;&#x435;&#x43C; &#x43F;&#x440;&#x435;&#x442;&#x445;&#x43E;&#x434;&#x438; &#x442;&#x430;&#x447;&#x43A;&#x430;. &#x41D;&#x435;&#x43A;&#x43E;&#x43B;&#x438;&#x43A;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430; &#x437;&#x430; &#x432;&#x440;&#x441;&#x442;&#x435; &#x448;&#x43A;&#x43E;&#x459;&#x43A;&#x438; &#x41F;&#x41E;&#x421;&#x418;&#x41A;&#x421; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x434;&#x430;:</p>

<pre><code>export LANG=nl               &#x425;&#x43E;&#x43B;&#x430;&#x43D;&#x434;&#x441;&#x43A;&#x438;
export LANG=nl_NL            &#x425;&#x43E;&#x43B;&#x430;&#x43D;&#x434;&#x441;&#x43A;&#x438;, &#x41D;&#x438;&#x437;&#x43E;&#x437;&#x435;&#x43C;&#x441;&#x43A;&#x430;
export LANG=nl_BE            &#x425;&#x43E;&#x43B;&#x430;&#x43D;&#x434;&#x441;&#x43A;&#x438;, &#x411;&#x435;&#x43B;&#x433;&#x438;&#x458;&#x430;
export LANG=es_ES            &#x428;&#x43F;&#x430;&#x43D;&#x441;&#x43A;&#x438;, &#x428;&#x43F;&#x430;&#x43D;&#x438;&#x458;&#x430;
export LANG=es_MX            &#x428;&#x43F;&#x430;&#x43D;&#x441;&#x43A;&#x438;, &#x41C;&#x435;&#x43A;&#x441;&#x438;&#x43A;&#x43E;
export LANG=en_US.iso88591   &#x415;&#x43D;&#x433;&#x43B;&#x435;&#x441;&#x43A;&#x438;, &#x421;&#x410;&#x414;, Latin-1 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435;
export LANG=en_GB.UTF-8      &#x415;&#x43D;&#x433;&#x43B;&#x435;&#x441;&#x43A;&#x438;, &#x423;&#x41A;, &#x423;&#x422;&#x424;-8 &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x430;&#x45A;&#x435;</code></pre>

<p>For a complete list of language and country codes see the gettext manual: <a href="https://www.gnu.org/software/gettext/manual/html_node/Usual-Language-Codes.html">https://www.gnu.org/software/gettext/manual/html_node/Usual-Language-Codes.html</a></p>

<p>&#x41D;&#x430; &#x408;&#x443;&#x43D;&#x438;&#x43A;&#x441; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x438;&#x43C;&#x430; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x443; &bdquo;locale(1)&ldquo; &#x434;&#x430; &#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x435; &#x458;&#x435;&#x437;&#x438;&#x43A;&#x430;.</p>

</dd>
<dt id="16"><b>&#x408;&#x415;&#x417;&#x418;&#x41A;</b></dt>
<dd>

<p>With the LANGUAGE environment variable you can specify a priority list of languages, separated by colons. Dos2unix gives preference to LANGUAGE over LANG. For instance, first Dutch and then German: <code>LANGUAGE=nl:de</code>. You have to first enable localization, by setting LANG (or LC_ALL) to a value other than &quot;C&quot;, before you can use a language priority list through the LANGUAGE variable. See also the gettext manual: <a href="https://www.gnu.org/software/gettext/manual/html_node/The-LANGUAGE-variable.html">https://www.gnu.org/software/gettext/manual/html_node/The-LANGUAGE-variable.html</a></p>

<p>&#x410;&#x43A;&#x43E; &#x438;&#x437;&#x430;&#x431;&#x435;&#x440;&#x435;&#x442;&#x435; &#x458;&#x435;&#x437;&#x438;&#x43A; &#x43A;&#x43E;&#x458;&#x438; &#x43D;&#x438;&#x458;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x43D; &#x434;&#x43E;&#x431;&#x438;&#x45B;&#x435;&#x442;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x434;&#x43D;&#x435; &#x43F;&#x43E;&#x440;&#x443;&#x43A;&#x435; &#x43D;&#x430; &#x435;&#x43D;&#x433;&#x43B;&#x435;&#x441;&#x43A;&#x43E;&#x43C;.</p>

</dd>
<dt id="DOS2UNIX_LOCALEDIR"><b>DOS2UNIX_LOCALEDIR</b></dt>
<dd>

<p>&#x421;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x43D;&#x459;&#x438;&#x432;&#x43E;&#x43C; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x45A;&#x430; &bdquo;DOS2UNIX_LOCALEDIR&ldquo; &bdquo;LOCALEDIR&ldquo; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x430; &#x443; &#x432;&#x440;&#x435;&#x43C;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x430;&#x446;&#x438;&#x458;&#x435; &#x441;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x43D;&#x438;&#x448;&#x442;&#x438;&#x442;&#x438;. &bdquo;LOCALEDIR&ldquo; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438; &#x437;&#x430; &#x43D;&#x430;&#x43B;&#x430;&#x436;&#x435;&#x45A;&#x435; &#x434;&#x430;&#x442;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x458;&#x435;&#x437;&#x438;&#x43A;&#x430;. &#x413;&#x41D;&#x423;-&#x43E;&#x432;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430; &#x432;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x458;&#x435; &bdquo;<code>/usr/local/share/locale</code>&ldquo;. &#x41E;&#x43F;&#x446;&#x438;&#x458;&#x430; &bdquo;<b>--version</b>&ldquo; &#x45B;&#x435; &#x43F;&#x440;&#x438;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &bdquo;LOCALEDIR&ldquo; &#x43A;&#x43E;&#x458;&#x438; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x438;.</p>

<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440; (&#x41F;&#x41E;&#x421;&#x418;&#x41A;&#x421; &#x459;&#x443;&#x441;&#x43A;&#x430;):</p>

<pre><code>export DOS2UNIX_LOCALEDIR=$HOME/share/locale</code></pre>

</dd>
</dl>

<h1 id="17">&#x420;&#x415;&#x417;&#x423;&#x41B;&#x422;&#x41D;&#x410; &#x412;&#x420;&#x415;&#x414;&#x41D;&#x41E;&#x421;&#x422;</h1>

<p>&#x41D;&#x430; &#x443;&#x441;&#x43F;&#x435;&#x445;, &#x440;&#x435;&#x437;&#x443;&#x43B;&#x442;&#x430;&#x442; &#x458;&#x435; &#x43D;&#x443;&#x43B;&#x430;. &#x41A;&#x430;&#x434;&#x430; &#x438;&#x43C;&#x430; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x441;&#x43A;&#x438;&#x445; &#x433;&#x440;&#x435;&#x448;&#x430;&#x43A;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x442;&#x430;&#x442; &#x458;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x45A;&#x430; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x430; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;. &#x417;&#x430; &#x434;&#x440;&#x443;&#x433;&#x435; &#x433;&#x440;&#x435;&#x448;&#x43A;&#x435; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x442;&#x430;&#x442; &#x458;&#x435; 1.</p>

<p>&#x412;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x441;&#x442; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x442;&#x430;&#x442;&#x430; &#x458;&#x435; &#x443;&#x432;&#x435;&#x43A; &#x43D;&#x443;&#x43B;&#x430; &#x443; &#x442;&#x438;&#x445;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443;, &#x438;&#x437;&#x443;&#x437;&#x435;&#x432; &#x43A;&#x430;&#x434;&#x430; &#x441;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x435; &#x43F;&#x43E;&#x433;&#x440;&#x435;&#x448;&#x43D;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x458;&#x435; &#x43B;&#x438;&#x43D;&#x438;&#x458;&#x435; &#x43D;&#x430;&#x440;&#x435;&#x434;&#x431;&#x438;.</p>

<h1 id="18">&#x421;&#x422;&#x410;&#x41D;&#x414;&#x410;&#x420;&#x414;&#x418;</h1>

<p><a href="https://en.wikipedia.org/wiki/Text_file">https://en.wikipedia.org/wiki/Text_file</a></p>

<p><a href="https://en.wikipedia.org/wiki/Carriage_return">https://en.wikipedia.org/wiki/Carriage_return</a></p>

<p><a href="https://en.wikipedia.org/wiki/Newline">https://en.wikipedia.org/wiki/Newline</a></p>

<p><a href="https://en.wikipedia.org/wiki/Unicode">https://en.wikipedia.org/wiki/Unicode</a></p>

<h1 id="19">&#x410;&#x423;&#x422;&#x41E;&#x420;&#x418;</h1>

<p>&#x411;&#x435;&#x43D;&#x45F;&#x430;&#x43C;&#x438;&#x43D; &#x41B;&#x438;&#x43D; &ndash; &lt;blin@socs.uts.edu.au&gt;, &#x411;&#x435;&#x440;&#x43D;&#x434; &#x408;&#x43E;&#x445;&#x430;&#x43D;&#x435;&#x441; &#x412;&#x435;&#x431;&#x435;&#x43D; (mac2unix) &ndash; &lt;wuebben@kde.org&gt;, &#x41A;&#x440;&#x438;&#x441;&#x442;&#x438;&#x458;&#x430;&#x43D; &#x412;&#x438;&#x440;&#x43B; (&#x434;&#x43E;&#x434;&#x430;&#x458;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43D;&#x438; &#x43D;&#x43E;&#x432;&#x438; &#x440;&#x435;&#x434;) &ndash; &lt;wurll@ira.uka.de&gt;, &#x415;&#x440;&#x432;&#x438;&#x43D; &#x412;&#x43E;&#x442;&#x435;&#x440;&#x43B;&#x430;&#x43D;&#x434;&#x435;&#x440; &ndash; &lt;waterlan@xs4all.nl&gt; (&#x43E;&#x434;&#x440;&#x436;&#x430;&#x432;&#x430;&#x43B;&#x430;&#x446;)</p>

<p>Project page: <a href="https://waterlan.home.xs4all.nl/dos2unix.html">https://waterlan.home.xs4all.nl/dos2unix.html</a></p>

<p>SourceForge page: <a href="https://sourceforge.net/projects/dos2unix/">https://sourceforge.net/projects/dos2unix/</a></p>

<h1 id="20">&#x412;&#x418;&#x414;&#x418;&#x422;&#x415; &#x422;&#x410;&#x41A;&#x41E;&#x402;&#x415;</h1>

<p>file(1) find(1) iconv(1) locale(1) xargs(1)</p>


</body>

</html>


